[{"url": "http://cfp.2016.devoxx.pl/2016/talk/GEX-2675/Opening.html", "abstract": "Opening talk", "confName": "Devoxx, Poland 2016", "title": "Opening"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/PCA-5713/Why_does_Yesterday's_Best_Practice_Become_Tomorrow's_Antipattern%3F.html", "abstract": "Modern software development exhibits a curious trend: Yesterday’s Best Practice Becomes Tomorrow’s Antipattern. Why? Haven’t we learned enough about software development to avoid this trap over and over? This keynote investigates why this trend continues, and offers some advice for escaping this vicious cycle.", "confName": "Devoxx, Poland 2016", "title": "Why does Yesterday's Best Practice Become Tomorrow's Antipattern?"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/DVC-3532/Coding_Microservices_Effectively.html", "abstract": "Focus on target domain, zero setup, monitoring and resiliency patterns included. In this session I will code, explain and deploy microservices on docker. Stock IDE, stock platform and lightening fast deployments. Getting things done in 1h. Questions are highly welcome.", "confName": "Devoxx, Poland 2016", "title": "Coding Microservices Effectively"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/OVU-4305/Cloud_Native_Java.html", "abstract": "“It is not necessary to change. Survival is not mandatory.” -W. Edwards Deming\nWork takes time to flow through an organization and ultimately be deployed to production where it captures value. It’s critical to reduce time-to-production. Software - for many organizations and industries - is a competitive advantage.\nOrganizations break their larger software ambitions into smaller, independently deployable, feature -centric batches of work - microservices. In order to reduce the round-trip between stations of work, organizations collapse or consolidate as much of them as possible and automate the rest; developers and operations beget “devops,” cloud-based services and platforms (like Cloud Foundry) automate operations work and break down the need for ITIL tickets and change management boards.\nBut velocity, for velocity’s sake, is dangerous. Microservices invite architectural complexity that few are prepared to address. In this talk, we’ll look at how high performance organizations like Ticketmaster, Alibaba, and Netflix make short work of that complexity with Spring Boot and Spring Cloud.", "confName": "Devoxx, Poland 2016", "title": "Cloud Native Java"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/OII-2927/Continuous_Integration_for_Web_&_JavaScript_Projects.html", "abstract": "This session covers the basics of setting up a Web & JavaScript project for Continuous Integration. The goal is to apply the same engineering practices as for projects coded in Java. Topics covered:\nBuild tool for JS: Grunt\nIntegrating JSHint\nAutomated testing setup\nOther tools as part of a build process: Webpack, transpiliation", "confName": "Devoxx, Poland 2016", "title": "Continuous Integration for Web & JavaScript Projects"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/BLZ-7878/The_good_monolith_-_bounded_contexts_in_practice.html", "abstract": "In the brave new world of micro-services one may have an impression that building monolithic apps is anti-pattern, even something to be ashamed of. I am here to tell you it is not true. There are lots of situations where monolith is better suited for the job, but it has to be maintainable.  In my presentation I will show you  how to use bounded context pattern to define maintainable components of your app and how to sprinkle some clean architecture onto it.", "confName": "Devoxx, Poland 2016", "title": "The good monolith - bounded contexts in practice"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/UDA-3676/The_Physical_World_meets_the_Web.html", "abstract": "New APIs and specs are now joining the Web that let us connect the Physical World with the Web. In this talk we will cover the Physical Web and the streaming of URLs through beacons, new APIs, such as Web Bluetooth and Web NFC, Geofencing, current and future compatibility.\nIn this talk we will make live demos that attendees will be able to test on their own mobile phones, including bluetooth beacons, URL discovery through the Physical World and other devices.", "confName": "Devoxx, Poland 2016", "title": "The Physical World meets the Web"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/MUQ-4065/Beyond_lambdas_-_the_aftermath.html", "abstract": "As Java developers we are used to having rich ecosystems of libraries and tools that make our lives easier. As of the release of Java 8, we finally got our hands on building blocks like lambdas, optionals, and streams. All sorts of tools that help us write more concise code. But now, when the honeymoon is over, are there any downsides to Java 8 or is it a silver bullet? Are there any new anti-patterns emerging? Or subtle bugs caused by the new style of programming? Have there been any lessons learned? Are there any best practices?\nIf you are interested in learning about the challenges encountered when moving over to a functional style of Java programming, what code constructs to avoid, and best practices to use, well then this session is for you.", "confName": "Devoxx, Poland 2016", "title": "Beyond lambdas - the aftermath"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/OAQ-5111/React.js:_A_Modern_Web_Framework.html", "abstract": "React.js is a view library from Facecbook for building performant user-interfaces in JavaScript. In this session, we'll explore React.js and understand why it's a great step forward for building complex UI's that run fast. We'll code up an example web application using React.js and step through the basics of using the library while discussing concepts like the virtual DOM and components.\nIn this session, we'll explore React.js and understand why it's a great step forward for building complex UI's that run fast. We'll code up an example web application using React.js and step through the basics of using the library while discussing concepts like the virtual DOM and components.", "confName": "Devoxx, Poland 2016", "title": "React.js: A Modern Web Framework"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/EUZ-4023/Real-world_analytics_with_Solr_Cloud_and_Spark.html", "abstract": "Apache Solr is a distributed NoSQL database with impressive search capabilities. Apache Spark makes M/R faster and richer. In this code-intense session shows how to combine both to solve real-time search and processing problems. The demos feature a portable Solr Cloud / Spark Cluster based on Intel NUC Hardware and Ubuntu Linux.", "confName": "Devoxx, Poland 2016", "title": "Real-world analytics with Solr Cloud and Spark"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/BOL-0420/Hotspot_&_AOT.html", "abstract": "Different Java implementations exist. Your code lives multiple lifes inside them and JIT compilers provide performance behind the scenes. Some JVMs have ahead-of-time (AOT) compilation that shortens the path. Statement of the problem is different, as well as solutions. Let's talk about why do we need pre-compiled code, how it can already be produced and used with Hotspot. How Project Graal lets Java to compile Java to native code and how new Java-Level JVM Compiler Interface incorporates Java to compilation work of JVM.", "confName": "Devoxx, Poland 2016", "title": "Hotspot & AOT"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/WRV-3066/Blockchain_and_distributed_ledgers_for_developers.html", "abstract": "You must have heard about Bitcoin. Publicly launched in 2009, it obtained massive public media attention a couple of years later.\nBesides a digital currency, the major innovation of Bitcoin is the blockchain, also known as a distributed ledger, a technology that uses cryptography to allow some systems that could only be modelled in a client-server fashion before to be modelled in a peer-to-peer fashion. Blockchain technology can be very useful outside the realm of digital currencies and finance, for example in the energy market, car maintenance history or international trade.\nWith my three years of experience with blockchains, I’m going to make sure there are a couple of takeaways for you in this presentation. You'll learn how blockchains works and see examples of blockchains in Java. You'll see how blockchain fits in a larger architecture, putting it in context with concepts like journals, event sourcing, CQRS. Finally, you will discover how to determine whether a blockchain may be appropriate for your project.", "confName": "Devoxx, Poland 2016", "title": "Blockchain and distributed ledgers for developers"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/COX-4408/Pwn'ed_within_48_hours.html", "abstract": "Never expose any services on the public internet without a security review! If you are running Tomcat servers, always hide and/or secure the manager UI.\nJoin this talk to see how Ray's Tomcat server was hacked within 48 hours since it was online that was running on a non-standard port. We'll take a look at the tools that the hackers deployed and what these tools can do.", "confName": "Devoxx, Poland 2016", "title": "Pwn'ed within 48 hours"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/ZXO-5284/Data_warehousing_on_Hadoop_-_one_important_DON'T_and_a_few_DOs.html", "abstract": "At the same time, you can have your lunch and learn why you should attend my evening BOF session. Does it sound like a good deal?\nThe brave new world of Big Data has been around for a while and its tools have been successfully applied to solve different problems. But is it a silver bullet? Is it really completely new? Can you forget the old truths of design, architecture and project management?\nThe goal of the StraDa project is to gather the log files from hundreds of Roche diagnostic instruments spread around the world and transform these TBs of data into a data warehouse.\nWe built it, but it wasn't a straightforward task.\nPlease come to learn what was the biggest mistake we made and then come back at 19:30 for a full-blown session.", "confName": "Devoxx, Poland 2016", "title": "Data warehousing on Hadoop - one important DON'T and a few DOs"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/ZMK-7035/Passwords:_do_you_keep_them_safe%3F.html", "abstract": "Some say that keeping passwords in a [web] application is a trivial task: some hashing, maybe some salt, et voilà! However, storing passwords and other sensitive data might not be as simple as it seems.\nYou'll see a bunch of examples of what to do and what not to do based on a freelance's experience. Come and see if you're not sitting on a bomb.", "confName": "Devoxx, Poland 2016", "title": "Passwords: do you keep them safe?"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/QRY-9225/How_to_walk_a_process_-_Controlling_LEGO_MINDSTORMS_using_BPMN.html", "abstract": "Workflows belong to our day-to-day business like LEGO to our childhood. Lacking though in many companies are appropriate transparency and reusability of these workflows. The \"Business Process Modeling Notation\" (BPMN) can eliminate these shortcomings and business departments and software technology are converging. In addition, the business world is visualized over different locations. The result consists of diagrams that serve as documentation for business and basis of process automation in IT.\nContrary to these aspects, the practical learning with LEGO Mindstorms comes along. A small robot is assembled in varied forms, fed with a Java API and controlled by external software. Serial and parallel individual steps awaken our mobile friend to life.\nIn this presentation, the arc between processes and robots is tensioned. Movements are defined with BPMN2, which are automated by means of a \"Business Process Engine\". The modeling approach including BPMN basics, structuring processes, and motor and sensory functions are illustrated during a live demo.\nAll in all a hot topic that certainly delights programmers and inventors, professionals and inexperienced, as well as adults and children.", "confName": "Devoxx, Poland 2016", "title": "How to walk a process - Controlling LEGO MINDSTORMS using BPMN"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/TBQ-2946/Why_Functional_Programming_Matters.html", "abstract": "In the latter half of the 2000s, a new kind of programming language seemed poised to take the steam out of the dominancen of object-oriented programming languages and their hold over \"mainstream\" development. But these new languages, collectively referred to as \"functional\" languages, were nothing new. In fact, they've been a part of the language landscape since the late 80s, and arguably even longer than that. What makes a functional language, and what makes a functional language interesting? Most importantly, why do we care now, thirty years after their introduction?", "confName": "Devoxx, Poland 2016", "title": "Why Functional Programming Matters"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/CVI-6955/Getting_Hip_with_JHipster.html", "abstract": "JHipster is a Yeoman generator which is used to rapidly create a Spring Boot and Angular JS project. JHipster leverages best of class technologies to build modern web applications. Spring Boot is used on the server side to provide a robust and performance Java stack, coupled with Angular JS and Bootstrap CSS for a modern, mobile-first front end. Learn how Yeoman, Bower, Gulp, and Gradle are used to build and manage project resources.", "confName": "Devoxx, Poland 2016", "title": "Getting Hip with JHipster"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/TON-0060/Successful_startup_is_NOT_enough.__You_must_scale_technology_to_ENTERPRISE_while_maintaining_your_startup_creativity..html", "abstract": "We will share with you the lean journey of the Sabre TripCase application from an undeveloped start-up to a full enterprise solution. From rapid development to high performing solutions, learn how to maintain flexibility by adopting the right 1. methodology, 2. technology, and 3. architecture for the right moment. We will share our findings and practical tips for Technology, Architecture, Operations, and Design evolution.", "confName": "Devoxx, Poland 2016", "title": "Successful startup is NOT enough.  You must scale technology to ENTERPRISE while maintaining your startup creativity."}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/MTJ-1344/Building_a_full-automated_Fast_Data_Platform.html", "abstract": "Many people promise fast data as the next step after big data. The idea of creating a complete end-to-end data pipeline that combines Spark, Akka, Cassandra, Kafka, and Apache Mesos came up two years ago, sometimes called the SMACK stack. The SMACK stack is an ideal environment for handling all sorts of data-processing needs which can be nightly batch-processing tasks, real-time ingestion of sensor data or business intelligence questions. The SMACK stack includes a lot of components which have to be deployed somewhere. Let’s see how we can create a distributed environment in the cloud with Terraform and how we can provision a Mesos-Cluster with Mesosphere Datacenter Operating System (DC/OS) to create a powerful fast data platform.", "confName": "Devoxx, Poland 2016", "title": "Building a full-automated Fast Data Platform"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/VDJ-0095/Nianczenie_programistow_vs._zarzadzanie_dziecmi.html", "abstract": "Czy zostałeś ostatnio awansowany z dewelopera na menedżera i czujesz się zagubiony? Albo zajmujesz się programowaniem w power poincie od lat i nadal jesteś zaskakiwany przez swój zespół? Nie martw się – też to przechodziliśmy i chętnie podzielimy się doświadczeniem. Mamy także dzieci…\nBycie managerem wiąże się z jednej strony z uczestnictwem w wielu kursach, setkami książek: rzeczy, które nauczyłeś się na studiach MBA, rzeczy których nie nauczysz się na MBA, psychologia w biznesie, zasoby ludzkie, coaching - lista tylko rośnie…\nZ drugiej strony, mówi się po prostu bądź dobra osobą, bądź spójny, uwierz w innych - to wystarczy. Zarządzanie ludźmi jest proste jak drut…\nKtóre podejście jest właściwe?\nPodczas spotkania dowiesz się, jak w praktyce zastosować kilka zasad zarządzania, które tworzą podstawy zarządzania deweloperami. Zweryfikujemy je na realnych przykładach z życia, czy sprawdziły się czy nie. Te zasady nie są lekiem na całe zło, one działają w pewnym kontekście, którego w naszych historiach nie zabraknie.\nCzy powyższe jest sekretem do uczynienia życia managera dużo bardziej prostym? Czy jesteś zainteresowany znalezieniem tego klucza?", "confName": "Devoxx, Poland 2016", "title": "Niańczenie programistów vs. zarządzanie dziećmi"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/VMZ-5956/Antifragile_Architectures.html", "abstract": "What is fragile? Fragile things are easily broken, damaged, or destroyed. When faced with stressors, they crumble. Then what is the opposite of that? Many of us would answer something like “robust” or “resilient.” Things that maintain their integrity when faced with stressors. But it’s possible that we’re wrong.\nIn his book Antifragile, Nassim Nicholas Taleb challenges this idea by inventing the word that forms the book’s title. Antifragile is the true opposite of fragile. Whereas fragile things are easily broken, damaged, or destroyed when faced with stressors, antifragile things improve, become stronger, or become more powerful when faced with stressors.\nCan we build software systems like this? Dick Gabriel explores the idea of ultra-large scale systems that self-regulate (and in fact thrive) in the face of unexpected changes and stressors in his essay “Design Beyond Human Abilities,” and Russ Miles explicitly calls out the idea of Antifragile Software in his book by the same name. During this session we’ll explore these ideas and what they mean to us as developers and architects.", "confName": "Devoxx, Poland 2016", "title": "Antifragile Architectures"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/CUS-7964/A_practical_RxJava_example_with_Ratpack.html", "abstract": "RxJava seems to be this awesome thing that every cool kids start using. But when you read about it, half of the time it's hard to make anything out of it. Sure the isolated examples look nice but it's always hard to put this in perspective with a real app.\nIn this talk I'll go through an application made to store, index and search files. We'll see the benefit brought by using RxJava and Ratpack. Nothing too complicated or advanced, just something pragmatic.", "confName": "Devoxx, Poland 2016", "title": "A practical RxJava example with Ratpack"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/KYN-6511/Prezentacje_i_wystapienia_-_jak_nie_tylko_przetrwac_ale_i_dobrze_sie_bawic.html", "abstract": "W życiu każdego programisty lub programistki pojawia się prędzej czy później smutny dzień, gdy dostaje od przełożonego propozycję nie do odrzucenia: zrób prezentację.\nBez względu na to, czy jest to prezentacja funkcjonalności, nad którą pracujemy, szkolenie wewnętrzne z tematu, w jakim się specjalizujemy, lansowanie w społeczności firmy, w której pracujemy, nawracanie niewiernych na nasz ulubiony ezoteryczny język czy framework, to twoje ciało i umysł chętnie wybawią Cię z tej opresji, załatwiając piękną reakcję psychosomatyczną typu syndrom jelita drażliwego, drgawki czy przejście w tryb prokastynacji.\nPodczas prezentacji przedstawię proces przygotowania oraz wzorce i techniki na poziomie merytorycznym oraz mentalnym, dzięki którym poczujesz się pewnie oraz odnajdziesz radość  i zabawę w tworzeniu prezentacji.\nZajmiemy się problemami: tremy, prokastynacji, przygotowania wciągającej narracji i unikania efektu \"zamulania\" w trakcie samego wystąpienia, na który składa się szereg błędów.\nPrezentacja jest przeznaczona dla IT Crowd - podejdziemy do problemu z punktu widzenia programisty, który od kilku lat prowadzi prezentacje dla ludzi podobnych do siebie.", "confName": "Devoxx, Poland 2016", "title": "Prezentacje i wystąpienia - jak nie tylko przetrwać ale i dobrze się bawić"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/FHE-5810/Building_common_libraries_and_not_failing_at_it.html", "abstract": "Common libraries. Almost every company makes them. Why do they often end up hated for becoming hard to maintain garbage? Does it have to be this way? Can we do better?\nIn this talk we'll explore various models of providing shared code for an organization and their consequences. We'll also dive into the art of designing and developing libraries – keeping them powerful and easy to use despite constant changes in requirements. We'll cover API design, handling of dependencies, deciding on features, structuring the tools ecosystem and much more. All this coming from experience (and mistakes) of building tools for the microservices infrastructure at Allegro.\nI hope to leave you with practical knowledge essential for building successful tools – both for growing internal commons ecosystems and for creating useful open-source projects.", "confName": "Devoxx, Poland 2016", "title": "Building common libraries and not failing at it"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/XZJ-4802/Tips_&_Tricks_for_a_Java_team.html", "abstract": "This session walks the audience through a few cool tips and tricks to modernize their application development and devops workflows. These include:\n1. How agile teams keep everything connected - plans, code, builds and releases\n2. On-demand workspaces in the cloud - a new way of collaborating on code\n3. How to leverage the cloud for building and deploying your applications\n4. Testing your mobile apps with real devices, without owning one\n5. User feedback and telemetry - leveraging beta releases and understanding usage from a live application\nTechnologies covered: Visual Studio Team Services, Microsoft Azure, Xamarin Test Cloud, Eclipse Che and Codenvy, HockeyApp", "confName": "Devoxx, Poland 2016", "title": "Tips & Tricks for a Java team"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/ZZT-5670/Microservices_Minus_the_Hype:_How_to_Build_and_Why.html", "abstract": "Few topics in software architecture discussions yield as much heat as that of microservices. Monolithic applications have dominated the landscape for years, and a large number of monoliths run a great many critical processes used to this day. More recently, companies with requirements for rapid release cycles and key \"ilities\" (maintainability, scalability, reliability, flexibility, extensibility) have chosen another approach, deploying functionality in more granular, API-driven modules: microservices.\nIn this session, the presenter will strip away the hype and speak frankly of the upsides & downsides of adopting a microservices architecture and why, with certain exceptions, the pros far outweigh the cons. Topics include Domain Driven Design & bounded contexts, increasing quality & velocity, horizontal vs. vertical scaling, portability, & more. The presenter will then show how to build & integrate microservices applications using Spring Boot, various data sources, & REST resources built to task. Load balancers, circuit breakers, tests, & other risk mitigation mechanisms will be demonstrated & discussed.\nLeave this session knowing how and why to max out on microservices!", "confName": "Devoxx, Poland 2016", "title": "Microservices Minus the Hype: How to Build and Why"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/ZZH-7425/Java_libraries_you_can't_afford_to_miss.html", "abstract": "The Java language has crossed it's 20th anniversary and with it comes an incredible range of tools libraries to choose from; sometimes there are too many choices for the same task. In this talk we'll cover those libraries that have risen to the top by proving themselves to be worthy of a place in every developer's toolbox, both for production and testing code. We'll  also cover some fairly new libraries that are bound to make a big impact in the ecosystem.", "confName": "Devoxx, Poland 2016", "title": "Java libraries you can't afford to miss"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/HPE-0572/JVM_dive_for_mere_mortals.html", "abstract": "For developers using Java on a daily basis, JVM is a pretty important component - it runs our software. But it is usually treated like a magic box, which takes code in and produces business features. Have you ever thought about what you are missing with such an approach? During my talk I'll cover some of the JVM internals which should not be avoided even during regular Java development. We'll discuss real differences between primitives and their wrappers, talk about the cost of using lambdas and streams, see what really gets erased in the type erasure process and what we can gain by removing stacktrace from our business exceptions.", "confName": "Devoxx, Poland 2016", "title": "JVM dive for mere mortals"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/TPH-8792/Project_Jigsaw_in_JDK_9:_Modularity_Comes_To_Java.html", "abstract": "Project Jigsaw will bring modularity to the Java platform; something that will enable better security, performance and flexibility for deployment of applications. This talk will look at the fundamentals of how modularity in Java will work. Developers will need to understand that these changes go significantly further than just separating the standard class libraries into a number of discrete units.\nThis talk will explain the impact project Jigsaw will have on developers in terms of building their applications, as well as helping them to understand how things like encapsulation will change in JDK 9.", "confName": "Devoxx, Poland 2016", "title": "Project Jigsaw in JDK 9: Modularity Comes To Java"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/BNG-0675/40_Tips_&_Tricks_for_Spring_in_IntelliJ_IDEA.html", "abstract": "IDEs can be powerful, but hard to learn. Some features are hidden or simply not well known.\nLet’s end this dilemma and make you more productive and efficient when working on Spring applications.\nLearn how to navigate, edit and perform refactorings across a variety of common Spring technologies.\nYou’ll leave this session with a whole stack of power tricks - right from the developers working on it.", "confName": "Devoxx, Poland 2016", "title": "40 Tips & Tricks for Spring in IntelliJ IDEA"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/JCA-5486/How_to_survive_and_thrive_in_a_BigCo.html", "abstract": "If you work at a small, cool company, you can skip this talk. The rest of us in large, slow moving companies that rely on meetings, email, and inbox 2,000 to get the daily work done need some therapy and advice for thriving in big, \"dumb\" companies. I've worked in such companies and figured out how to thrive in the \"back to back meetings\" world we're taught to avoid. I'll tell you my tactics.\nIdeally, you’d adapt the no manager GitHub dream, adapt the Spotify and Netflix cultures of awesomeness. Indeed. However, oftentimes there are good reasons to stay in the relatively dysfunctional companies you’re at. They’re big, slow moving, and seem to use Microsoft Office as their core innovation engine.\nIf people at your work always talk about “aircraft carriers” this is the talk for you.", "confName": "Devoxx, Poland 2016", "title": "How to survive and thrive in a BigCo"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/KSG-1056/Reactive_Fault_Tolerant_Programing_with_Hystrix_and_RxJava.html", "abstract": "As we build distributed systems composed of microservices, we introduce new potential performance problems and failure points. As the number of nodes in our system increases, these problems rapidly amplify. In order to keep our composite systems responsive, we can apply the techniques of reactive programming. In order to keep our composite systems healthy, we can apply fault tolerance patterns like circuit breakers and bulkheads.\nIn this presentation we’ll examine how to leverage two popular libraries from Netflix, Hystrix and RxJava, to create reactive and fault tolerant systems.", "confName": "Devoxx, Poland 2016", "title": "Reactive Fault Tolerant Programing with Hystrix and RxJava"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/YWU-8656/2FA,_WTF%3F.html", "abstract": "Everyone is hacking everything. Everything is vulnerable. Your site, your users, even you. Are you worried about this? You should be!\nDon't worry, I'm not trying to scare you (that much). We have plenty of safeguards against attempts on our applications' user data. We all (hopefully) recognise Two Factor Auth as one of those safeguards, but what actually goes on under the hood of 2FA?\nWe'll take a look into generating one time passwords, implementing 2FA in web applications and the only real life compelling use case for QR codes. Together, we'll make the web a more secure place.", "confName": "Devoxx, Poland 2016", "title": "2FA, WTF?"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/JOA-1945/Continuous_improvement,_developing_yourself_and_others.html", "abstract": "Have you ever wondered why your manager pushes you to those nasty communication trainings? Why your colleagues do not understand those simple concepts that you churn through. And even worse, they complain to your boss about you!\nOn the other hand, why that smart developer sits alone in a corner, does not share, do not PP, and hides his commits, while you could learn all from him.\nWhy there is no “I” in a “team” word, and what is up with those teams at all, where the heck disappeared the concept of coding alone in your basement around midnight!\nLot of material, so we'll touch on each topic of : learning, working together, motivating ourselves and what are the differences between us and tools to visualize them", "confName": "Devoxx, Poland 2016", "title": "Continuous improvement, developing yourself and others"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/JNY-7131/Real-time_mapping_with_the_drone.html", "abstract": "You can do many things with a quadcopter. We, as fanatic real-time strategy gamers, wanted our drone to listen to our commands given at the map level, revealing the terrain below it as it flies and creating a coherent and smooth map.\nHovewer funny and amusing, this will be a presentation about serious, high-level technology, unpredictable ideas and insistent scientific struggle to make all the algorithmic meat work on a flying machine.\nDuring this presentation we will tell you how we created our first successful prototype, we will show the demonstration videos and will explain our technology based on video processing, accelerometer data control and localization using particle filtering algorithm.\nIf you are planning to remotely prepare the map of the Moon (or your living room), you cannot miss this presentation.", "confName": "Devoxx, Poland 2016", "title": "Real-time mapping with the drone"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/CPP-6057/The_Spring_BOF.html", "abstract": "A BOF for all fans of Spring to talk about the latest and greatest tech, including Spring Boot, the convention-over-configuration centric framework built on top of Spring.", "confName": "Devoxx, Poland 2016", "title": "The Spring BOF"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/UGH-1133/DevOps_Assessment_Workshop:_How_to_achieve_quick_returns_with_speed_in_Application_delivery%3F.html", "abstract": "Value stream mapping is a technique that can be used to enable a DevOps transformation. It allows you to see where the bottlenecks and inefficiencies are in your delivery pipeline. In this collaborative workshop session, you will learn how to develop a value stream map of your delivery pipeline, identify obstacles across it, target DevOps practices that address your specific needs and develop a pragmatic approach to get started.", "confName": "Devoxx, Poland 2016", "title": "DevOps Assessment Workshop: How to achieve quick returns with speed in Application delivery?"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/EOG-2114/Data_warehousing_on_Hadoop_-_after_a_few_months_in_production.html", "abstract": "Medical laboratory instruments produce immense volumes of log files. Until recently, they were used only for trouble shooting and maintenance purposes. However, hidden inside are insights that could allow the laboratory managers to streamline and optimize the diagnostic process.\nThe goal of the StraDa project is to gather the log files from hundreds of Roche diagnostic instruments spread around the world, transform these TBs of data into actionable information and make it available for the business users.\nYet another data warehouse? Sounds reasonably easy? Well, so we thought. And we were wrong.\nPlease come to learn about some of the mistakes we made and problems we encountered, so you can avoid them.\nI will have slides, but I don’t need to follow them. Ask questions! Challenge me! Share you own experience!", "confName": "Devoxx, Poland 2016", "title": "Data warehousing on Hadoop - after a few months in production"}, {"url": "http://cfp.2016.devoxx.pl/2016/talk/LYV-4471/The_State_of_Asynchronous_Programming_in_Java:_Completable_or_Reactive_Future%3F.html", "abstract": "While synchronous APIs are still used for the vast majority of applications running on JVM, asynchronous, non-blocking programming models are gaining popularity, especially within microservices space, where inter-service calls are remote by definition and blocking can be very detrimental for application performance.\nCompletableFuture enables async, promise-based programming in Java, and is probably one of the most powerful and most overlooked additions to Java 8, but it is not the only game in town. Reactive frameworks, such as RxJava and Spring Reactor provide some of the same features and more.\nThis BOF would allow the attendees to discuss their experiences using any of these async frameworks, compare and contrast the available options, and when it makes more sense to use one over the other.", "confName": "Devoxx, Poland 2016", "title": "The State of Asynchronous Programming in Java: Completable or Reactive Future?"}]