[{"url": "https://qconlondon.com/london-2016/presentation/spring-framework-5-preview-roadmap.html", "abstract": "The Spring team is busily working on Spring Framework 5.0, with a release candidate scheduled for Q4 2016. This presentation covers the key themes in Spring 5, based on the current state of development: going Java 8+ across the entire framework codebase, comprehensive support for JDK 9, a strong focus on HTTP/2, and first-class support for Spring-style reactive architectures.", "confName": "QCon, London 2016", "title": "Spring Framework 5 - Preview & Roadmap"}, {"url": "https://qconlondon.com/london-2016/presentation/patterns-reliable-stream-processing-scale.html", "abstract": "Modern data streaming systems process millions of messages per second. To extract value from their data, organizations employ horizontally scalable distributed event processors such as Apache Storm. Such architectures are frequently designed under the assumption that data loss and calculation errors are acceptable.\nIn other cases, Kappa architecture is used to fulfill performance requirements without sacrificing consistency and reliability. And given the typical data consistency and performance requirements, external state and reliance on world clock become a taxing and hardly maintainable choice.\nIn this talk, we will discuss how we handled the challenges when building 1.5M msg/sec global processing system with Apache Storm and Apache Kafka at Integral Ad Science. We will inspect technology agnostic patterns reemerging in multiple applications including stream rewind technique, volatile in-memory state, derived logical time and synchronization, benefits of components collocation, and precision/performance trade offs.", "confName": "QCon, London 2016", "title": "Patterns of reliable in-stream processing @ Scale"}, {"url": "https://qconlondon.com/london-2016/presentation/continuous-delivery-benefits-explained.html", "abstract": "Although Continuous Delivery has gone viral after the seminal book by Jez Humble and Dave Farley, there is still doubt on its benefits and lack of understanding on the practices to achieve the maximum benefits. In this talk, I will attempt to add my two cents based on our three years' journey to CD at Paddy Power. In particular, I will discuss six benefits of continuous delivery we achieved.\nFor each benefit, I will explain why the benefit matters to the survival of today's businesses, the concrete measurement of the benefit, and the practices one need to follow to achieve it. The practices go beyond build, test, and deployment automation, and cover areas of organisation, process, requirements, architecture, etc.", "confName": "QCon, London 2016", "title": "Continuous Delivery: Benefits Explained"}, {"url": "https://qconlondon.com/london-2016/presentation/understanding-core-clojure-functions.html", "abstract": "Note: This talk replaces a cancellation for Creating a distuptive property portal with Clojure.\nEvery language has many pre-defined core functions, so we can quickly get on building what we really want. This ease of use does come with a cost, though. Do we really know the power of the magic that we are wielding? In this presentation we will look at how to implement our own versions of the Clojure functions reduce, count, filter, map and pmap. The pace will start gently for those with little Clojure experience to follow, but will then dive deep to provide a full understanding.", "confName": "QCon, London 2016", "title": "Understanding Core Clojure Functions"}, {"url": "https://qconlondon.com/london-2016/presentation/willhillbet-love-failure-embrace-fall-out.html", "abstract": "How do you design a system that handles 7,000,000+ product price changes per day, 160TB of data flowing through your network, at peak 460 transactions per second, 3 billion transactions per year. We trade globally, taking and settling the millions of bets placed during the Grand National, World Cup, Euros, Cheltenham, Melbourne Cup, Superbowl, from the smallest local event to the biggest globally.\nHow do you make such a system resilient to failure, robust enough to route around slow or out of service components, flexible enough to be operated and upgraded without downtime and elastic to cope with the peaks and troughs of the sporting calendar.\nWe will look at the problems presented by an existing traditional database centric architecture, and examine some architectural patterns that we are exploring for our new sports betting systems - a micro service active/active/active stream based architecture, deployed with docker where every container is treated as ephemeral which may be taken out of service at any time, where multiple systems compete to do work, and are spun up or down according to load, a system where data flows to where it is required.", "confName": "QCon, London 2016", "title": "@WillHillBet: Love failure & embrace the fall out"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/performance-testing.html", "abstract": "The performance of your application affects your business more than you might think. Top engineering organisations think of performance not as a nice-to-have, but as a crucial feature of their product. Those organisations understand that performance has a direct impact on user experience and, ultimately, their bottom line. Unfortunately, most engineering teams do not regularly test the performance and scalability of their infrastructure. Take back an understanding of how to automate performance and load testing and evaluate the impact it has on performance and your business.", "confName": "QCon, London 2016", "title": "Performance testing"}, {"url": "https://qconlondon.com/london-2016/presentation/project-jigsaw-jdk-9-modularity-comes-java.html", "abstract": "Project Jigsaw will bring modularity to the Java platform; something that will enable better security, performance and flexibility for deployment of applications. This talk will look at the fundamentals of how modularity in Java will work. Developers will need to understand that these changes go significantly further than just separating the standard class libraries into a number of discrete units.\nThis talk will explain the impact project Jigsaw will have on developers in terms of building their applications, as well as helping them to understand how things like encapsulation will change in JDK 9.", "confName": "QCon, London 2016", "title": "Project Jigsaw in JDK 9: Modularity Comes To Java"}, {"url": "https://qconlondon.com/london-2016/presentation/stream-processing-apache-flink.html", "abstract": "Data streaming is gaining popularity, as more and more organizations are realizing that the nature of their data production is continuous and unbounded, and can be better served with a streaming architecture. Streaming architectures promise decreased latency from signal to decision, a radically simplified data infrastructure architecture, and the ability to cope with new data that is generated continuously. Apache Flink is a full-featured true stream processing framework with:\n\nEasy to use Java- and Scala-embedded APIs that make stream analytics easy, yet provide powerful tools to deal with time and uncertainty\nThroughput close to a million of events per second per core\nLatencies as low as the millisecond range\nFull support for event time and out of order arrivals with flexible windows, watermarks, and triggers\nExactly-once consistency guarantees, and the ability to realize distributed transactional data movement between systems (e.g., between Kafka and HDFS)\nEase of configuration and separation between application logic and fault tolerance via a novel asynchronous checkpointing algorithm\nNo single point of failure\nIntegration with popular open source infrastructure (e.g., Hadoop, HBase, Kafka, Cascading, Elasticsearch, â\u0080¦)\nBatch processing as a special case of stream processing, including dedicated libraries for machine learning and graph processing, managed memory on-, and off-heap, and query optimization\n\nFlink is used in several companies, including at ResearchGate, Bouygues Telecom, the Otto Group, and Capital One, and has a large and active developer community of well over 140 contributors. In this talk, we provide an overview of the system internals and its streaming-first philosophy, as well as the programming APIs.", "confName": "QCon, London 2016", "title": "Stream processing with Apache Flink"}, {"url": "https://qconlondon.com/london-2016/presentation/immutable-infrastructure-rise-machine-images.html", "abstract": "The cloud is the new normal and it is time to rethink how we see machines and deployments. We have been piling layer upon layer of complexity for too long. But why should it be this way? It is time to radically simplify all this.\nIn this talk, we'll throw general-purpose operating systems, snowflake servers and runtime provisioning out the door. Instead you'll see how servers become disposable, how machine images are generated from scratch in seconds and how to achieve perfect environment parity from dev to prod.\nThis is Immutable Infrastructure. It is a profoundly important change as to how we view and treat our systems. We'll go deep. We'll look at how this affects scaling, logging, sessions, configuration, service discovery and more. We'll also look at how containers and machine images compare and why some things you took for granted may not be necessary anymore.\nBut beware, neither sacred cows nor kittens will be spared!", "confName": "QCon, London 2016", "title": "Immutable Infrastructure: Rise of Machine Images"}, {"url": "https://qconlondon.com/london-2016/presentation/introduction-property-based-testing.html", "abstract": "We spend quite a bit of time (or should) testing the systems that we build. Early on in a systems life this time is spent creating tests and exploring the structure and design of our systems. As systems age the majority of this time is spent maintaining those tests as the system takes new shapes. Our approach to testing heavily impacts how much time is necessary to keep our tests in line and useful.\nThis talk will focus on an approach to testing that focuses on describing your system as a series of models that can be used to systematically and automatically generate input data and ensure that your code is behaving as expected.\nJoin Aaron as he introduces you to property based testing and how it can help you build more resilient systems and even reduce your time maintaining your current test suite. You will explore property based testing from a few different languages and perspectives as well as learn some advanced techniques for testing hard to test legacy code.", "confName": "QCon, London 2016", "title": "An Introduction to Property Based Testing"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/how-win-hearts-and-minds.html", "abstract": "How often do you come across â\u0080\u0098politicsâ\u0080\u0099 in your workplace as a challenge or impedance on your work?\nIn this talk we will share the methods used in political campaigns and show how they can be applied to the workplace to help you achieve your goals.\nWe will look at the challenges of influencing the opinions and behaviours of people who are either disengaged or have a vested interest not to change.\nWeâ\u0080\u0099ll show you how you can assess your situation as you would a political campaign, and how to identify the information and resources necessary to achieve your â\u0080\u009cvictoryâ\u0080\u009d.\nYouâ\u0080\u0099ll learn an approach to segmentation designed to generate momentum and increase your grassroots support.\nYouâ\u0080\u0099ll learn how to create a relevant and meaningful vision that people easily understand and will want to support and share with others.\nWeâ\u0080\u0099ll look at ways of acquiring regular feedback - â\u0080\u009cpollingâ\u0080\u009d - that enables you to best focus your resources and remain relevant to your supporters.\nOur goal is for you to be able to take these tools and techniques to influence and change your situation for the better.\nThis talk is based on a workshop run at Lean Agile Scotland, where it received positive feedback, and internally at a major UK broadcaster and a small independent consultancy.", "confName": "QCon, London 2016", "title": "How to win hearts and minds"}, {"url": "https://qconlondon.com/london-2016/presentation/using-technology-blind-long-distance-runner.html", "abstract": "Simon will talk about the app that keeps him going and allows him to run solo even though blind powered by IBM Cloud. His presentation will explain how he uses Runkeeper's mobile application to overcome his challenge to do what he loves i.e. to run. The Runkeeper app, using IBM Cloud Analytics, tells Simon the distance and pace of his run and using that information he creates a mental map that allows him to run independently so that he doesn't bump into lampposts.\nSimon will delve into more detail on how he does itâ\u0080\u0094changes in the terrain he's feeling underfoot are a key element. It goes without saying that his success is more a testament to his spirit than any technology, and many people are using Runkeeper, but it is interesting that cloud is powering so many of the things that we take for granted these days. e.g. IBM Cloud helps Runkeeper process 120,000 global data requests every second.\nThis is a great showcase of how IBM Cloud is having an impact on society and enabling inspirational stories like Simon's about how IBM Cloud, Mobile and Analytics are transforming Simon's experience of running so that even though he is blind he can now run solo using some great cognitive innovations which have helped get him to where he is today.", "confName": "QCon, London 2016", "title": "Using technology as a blind long distance runner"}, {"url": "https://qconlondon.com/london-2016/presentation/netty-apple-large-scale-deployment-connectivity.html", "abstract": "Learn how Apple uses Netty for its Java based Services and the challenges of doing so, including how we enhanced performance by participating in the Netty OpenSource community. A deep dive into advanced topics like JNI, JVM internals, among others, will be included.", "confName": "QCon, London 2016", "title": "Netty @Apple: Large Scale Deployment/ Connectivity"}, {"url": "https://qconlondon.com/london-2016/presentation/microservices-streaming-world.html", "abstract": "The world of Microservices is a little different to standard service oriented architectures. They play to an opinionated score of decentralisation, isolation and automation. Stream processing comes from a different angle though. One where analytic function is melded to a firehose of in-flight events. Yet business applications increasingly need to be data intensive, nimble and fast to market. This isnâ\u0080\u0099t as easy as it sounds.\nThis talk will look at the implications of mixing toolsets from the stream processing world into realtime business applications. How to effectively handle infinite streams, how to leverage a high throughput, persistent Log and deploy dynamic, fault tolerant, streaming services. By mixing these disparate domains weâ\u0080\u0099ll see how we can build application architectures that can withstand the full force and immediacy of the data generation.", "confName": "QCon, London 2016", "title": "Microservices for a Streaming World"}, {"url": "https://qconlondon.com/london-2016/presentation/applied-cicd-enabling-creativity-volvo-trucks.html", "abstract": "Enabling Creativity â\u0080\u0093 the truck system with Continuous Integration and Virtualization demonstrated.\nThe automotive industry is on the verge of a fundamental revolution as the vehicle themselves becomes autonomous â\u0080\u0093 Continuous Integration and Continuous Delivery using virtualizations linked to real trucks will play key roles in making this happen. The heavy duty truck industry will be in the center of this major change. Trucks are already today advanced technical products with internet integrated functions; however, this is still very limited compared to what we will see in the upcoming years. This change will offer fascinating possibilities for innovation and creativity when trucks will be parts of integrated autonomous transport solutions.", "confName": "QCon, London 2016", "title": "Applied CI/CD: Enabling Creativity @Volvo Trucks"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/resilient-predictive-data-pipelines.html", "abstract": "Big Data companies (e.g. LinkedIn, Facebook, Google, and Twitter) have historically built custom data pipelines over bare metal in custom-designed data centers. In order to meet strict requirements on data security, fault-tolerance, cost control, job scalability, and uptime, they need to closely manage their core technology. Like serving systems (e.g. web application servers and OLTP databases) that need to be up 24x7 to display content to users, data pipelines need to be up and running in order to pick the most engaging and up-to-date content to display. In other words, updated ranking models, new content recommendations, and the like are what make data pipelines an integral part of an end userâ\u0080\u0099s web experience.\nAgari, a leading email security company, is applying big data best practices to the problem of securing its customers from email-born threats. Like many start-ups before it, Agari runs a lean organization that leverages the Cloud (AWS) for its infrastructure needs. However, in order to meet the needs of our business, we, at Agari, have designed and implemented a system that leverages the best of both the cloud (AWS's SNS, SQS, Kinesis, Auto-scaling, S3, Lambda, API Gateway, etc...) and Big Data (Spark, Airbnb's Airflow, etc...) in a maintainable way.", "confName": "QCon, London 2016", "title": "Resilient Predictive Data Pipelines"}, {"url": "https://qconlondon.com/london-2016/presentation/cargo-culture-imitation-can-be-suicide.html", "abstract": "Glen is here to warn you: Changing culture is not just adding beanbags, a games room, a snack cupboard and hack days! Everyone wants to build a great company culture, its the latest industry 'thing', its considered the biggest drawcard to attract and maintain talent, but have you really thought about what changing culture will really be like, in the real world?\nIn this talk Glen warns how Cargo Cults (imitation without understanding) are not only a danger in many facets of our industry but can also be incredibly destructive when applied to changing how your own company culture works.\nDrawing on his 20 years on the tech and management side of the industry in just about every culture (ranging from public service through corporate, research and various successful and unsuccessful start-ups), he will use real life stories, observations and lessons learned (the hard way) to highlight the dangers and pitfalls of attempting to imitate others and give you food for thought on building your own.", "confName": "QCon, London 2016", "title": "Cargo \"Cult\"ure: Imitation can be Suicide"}, {"url": "https://qconlondon.com/london-2016/presentation/choosing-right-cloud-provider.html", "abstract": "As more and more software services move to the cloud, and more and more players enter this lucrative market, we are faced with many questions when we choose our providers, especially when evaluating Software as a Service platforms.\n- Assessing a service is as good as it claims to be\n- Evaluating the service is to stay\n- Measuring performance and making sure you are not being under provisioned\n- Understanding when it's time to look for alternatives or BYO\nIn this talk, Yoav Landman, JFrog CTO and co-founder, will share JFrog's developers and DevOps insights gained from working with many SaaS cloud providers over the past 8 years. What you should look for before signing up with a provider, and what you should watch out for once you have made a selection.", "confName": "QCon, London 2016", "title": "Choosing the right cloud provider"}, {"url": "https://qconlondon.com/london-2016/presentation/hot-code-faster-code-addressing-jvm-warm.html", "abstract": "What is the JVM warm-up problem, and how does it affect our software? How can we aid the runtime in optimising our programs, and is it even a good idea to do so?\nThis presentation explores the lifecycle of Java code, and how the JVM evolves the runtime representation of code during program execution. From bytecode to assembly and back again (via some uncommon traps), we will cover practical tips on ensuring that Java code is running fast when it matters most.", "confName": "QCon, London 2016", "title": "Hot code is faster code - addressing JVM warm-up"}, {"url": "https://qconlondon.com/london-2016/presentation/streaming-auto-scaling-google-cloud-dataflow.html", "abstract": "Resource allocation and tuning of large data-parallel pipelines has traditionally been a manual process based on human oversight and as such is costly, wasteful, and high latency. Pipelines might see spikes in input rates, organic traffic growth, or fall behind due to outages or throttling of other services. Typically, such variation forces operators to either overprovision their resources for the worst-case, or to manually monitor and adjust resources when necessary. Both of these approaches are costly.\nIn this talk, we describe how we tackled one particular resource allocation aspect of Google Cloud Dataflow pipelines, namely, horizontal scaling of worker pools as a function of pipeline input rate. Managing the re-distribution of key ranges across new pool sizes and the associated persistent data storage was particularly challenging. We will go into details on the signals we use and the up- and down-scaling logic.", "confName": "QCon, London 2016", "title": "Streaming auto-scaling in Google Cloud Dataflow"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/unfrying-your-brain-f.html", "abstract": "F#, just like other non-pure functional languages, allows you find the sweet spot between FP practices and OO language pragmatism. Most of the advanced features of F# give you the power to change the language and to introduce a higher level of abstraction to your code. In this talk, we will discuss active patterns, computation expressions, parsers, using type providers and more. These language features help you make your code simpler and easier to maintain.", "confName": "QCon, London 2016", "title": "Unfrying your brain with F#"}, {"url": "https://qconlondon.com/london-2016/presentation/cassandra-apple-scale.html", "abstract": "Apple runs Cassandra at a very large scale which leads to some interesting challenges. This talk will cover many such challenges including Corruption Detection during Gossip, Distributed Deletes coupled with corrupt data and consistent host replacement.", "confName": "QCon, London 2016", "title": "Cassandra at Apple Scale"}, {"url": "https://qconlondon.com/london-2016/presentation/growing-unruly.html", "abstract": "Note: This talk replaces a cancellation for \"How to copy Spotify in 30min.\"\nUnruly is the leading global platform for social video advertising, we're celebrating our 10th birthday this year. Unruly has grown from a tiny startup to global organisation recently acquired by News. Its secret weapon is passionate people on a mission to #DeliverWow. Anyone who walks in the door of our offices sees our culture at work. Our workspaces are full of personal touches that help our teams work together around the globe. Come to this talk to hear how we keep our values alive and kicking.", "confName": "QCon, London 2016", "title": "Growing Up Unruly"}, {"url": "https://qconlondon.com/london-2016/presentation/apache-ignite%E2%84%A2%C2%A0%E2%80%93%C2%A0-memory-data-fabric.html", "abstract": "This presentation will provide a deep dive into the new Apache project: Apache Ignite. Apache Ignite is the in-memory data fabric that combines in-memory cluster & computing, in-memory data grid and in-memory streaming under one umbrella of a fabric. In-memory data fabric slides between applications and various data sources and provides ultimate performance and scalability to the applications.\nApache Ignite is the first general purpose in-memory computing platform in the Apache Software Foundation family. We believe it will have the same effect on Fast Data processing as Hadoop has on Big Data processing. Better understanding of inner details behind Apache Ignite will hopefully encourage more companies and individual committers to join the project.", "confName": "QCon, London 2016", "title": "Apache Igniteâ\u0084¢Â â\u0080\u0093Â In-Memory Data Fabric"}, {"url": "https://qconlondon.com/london-2016/presentation/java-9-g1-gc-awakens.html", "abstract": "This is a G1 readiness session. In this session, attendees will learn more about G1 pause (young and mixed) composition, G1's remembered sets and collection set and G1's concurrent marking algorithm. The speaker will also cover performance tuning advice for \"taming\" mixed collections and evacuation failures.", "confName": "QCon, London 2016", "title": "Java 9 - The (G1) GC Awakens!"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/cd-lmax-testing-production-and-back-again.html", "abstract": "The development team at LMAX Exchange has pioneered Continuous Delivery right from our beginnings through to the present day where we are building and operating a platform that processes almost $2.0 trillion of trades a year.\nIn this talk we'll take you through our mature pipeline and practices: demonstrating the variety of testing we have built in, how good test isolation has enabled us to extend our functional tests into live monitoring of production, and how a commitment to incremental delivery, quality and automation have created a sustainable environment for producing great software fast.", "confName": "QCon, London 2016", "title": "CD at LMAX: Testing into production and back again"}, {"url": "https://qconlondon.com/london-2016/presentation/types-working-you-not-against-you.html", "abstract": "There's a perception that Scala is too complicated.In part that may come from cryptic compiler errors and hard to understand types.You might be left wondering: what's the point?Why am I trying to hack my way through cruft?\n1. There's a way of writing simple Scala. A few straightforward ideas can be used again and again.You're using the power and flexibility of Scala, but in a sane way. This might not be the Scala you've heard about.\n2. The type system enables us to do more. It's not just about checking for errors. These ideas from the world of functional programming aren't about being \"clever\" (in the bad sense). It's about a useful set of tools for everyday coding. This might not be the functional programming you've heard about.\nThe talk is in three parts:\n\nAn example of what Scala looks like when using pattern matching over classes;\nHow encoding an idea into types (using the \"Combinable\", or \"monoid\" if you prefer that kind of word); and\nUsing advanced features of Scala (compile-time sized checked collections) without having to complicate our own code.\n\nIf you're Scala-curious, or heard that Scala or functional programming with types is just insanely complicated, this is the talk for you.", "confName": "QCon, London 2016", "title": "Types working for you, not against you"}, {"url": "https://qconlondon.com/london-2016/presentation/staying-sync-transactions-streams.html", "abstract": "For the very simplest applications, a single database is sufficient, and then life is pretty good. But as your application needs to do more, you often find that no single technology can do everything you need to do with your data. And so you end up having to combine several databases, caches, search indexes, message queues, analytics tools, machine learning systems, and so on, into a heterogeneous infrastructure...\nNow you have a new problem: your data is stored in several different places, and if it changes in one place, you have to keep it in sync in the other places, too. It's not too bad if all your systems are up and running smoothly, but what if some parts of your systems have failed, some are running slow, and some are running buggy code that was deployed by accident?\nIt's not easy to keep data in sync across different systems in the face of failure. Distributed transactions and 2-phase commit have long been seen as the \"correct\" solution, but they are slow and have operational problems, and so many systems can't afford to use them.\nIn this talk we'll explore using event streams and Kafka for keeping data in sync across heterogeneous systems, and compare this approach to distributed transactions: what consistency guarantees can it offer, and how does it fare in the face of failure?", "confName": "QCon, London 2016", "title": "Staying in Sync: From Transactions to Streams"}, {"url": "https://qconlondon.com/london-2016/presentation/far-mobbing-crowd.html", "abstract": "Classic agile development assumes co-location, but the world is quickly becoming decentralised and remote working is becoming more commonplace. We need new practices to help overcome the new problems that remote collaboration brings.\nAt Cucumber Ltd we have team of experienced XP practitioners building our SaaS product Cucumber Pro. To help us quickly and effectively build a team with a shared understanding of the product goals we chose mob programming. But weâ\u0080\u0099re a distributed team.\nIn this talk youâ\u0080\u0099ll hear how we overcame the challenges involved with team members distributed across time and space, and how we deal with the intensity of remote collaboration. Weâ\u0080\u0099ll talk about the tools that helped us, and the ones that didnâ\u0080\u0099t. Youâ\u0080\u0099ll learn how we approached continuous improvement and the new practices weâ\u0080\u0099ve evolved along the way.", "confName": "QCon, London 2016", "title": "Far from the mobbing crowd"}, {"url": "https://qconlondon.com/london-2016/presentation/not-continuous-delivery-if-you-can%E2%80%99t-deploy-now.html", "abstract": "Itâ\u0080\u0099s not uncommon for people to say things like â\u0080\u009cweâ\u0080\u0099re practicing Continuous Delivery, I can hand off to team X at any timeâ\u0080\u009d. This talk will cover types of automated testing such as security and performance which are frequently left out of a deployment pipeline. Weâ\u0080\u0099ll cover a subset of some of the tools and talk about strategies for running these tests in parallel for fast feedback.", "confName": "QCon, London 2016", "title": "Not Continuous Delivery if you canâ\u0080\u0099t deploy now"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/realtime-stream-computing-analytics-uber.html", "abstract": "Uber is making rapid strides as a thriving Marketplace/Logistics platform. The Marketplace system consists of a set of services that are responsible for handling rider requests and other fulfillment requests from UberEats, Rush etc. To make our Marketplace system efficient and intelligent, we need to extract deep and timely insights from our carefully curated data. We also have to make the insights easily accessible for both people (Operations, Data Scientists and Engineers) and Machines to consume in real time.\nThis talk will discuss how stream processing is used within the Uber's Marketplace system to solve a wide range problems, including but not limited to realtime indexing and querying of geospatial time series, aggregation and computing of streaming data, and extracting patterns from data streams. In addition, it will touch upon various TimeSeries analysis and predictions. The underlying systems utilize many open source technologies such as Apache Kafka, Samza and Spark streaming.", "confName": "QCon, London 2016", "title": "Realtime Stream Computing &Analytics @Uber"}, {"url": "https://qconlondon.com/london-2016/presentation/acceptance-testing-continuous-delivery.html", "abstract": "Writing and maintaining a suite of acceptance tests that can give you a high level of confidence in the behaviour and configuration of your system is a complex task. In this talk, Dave describse approaches to acceptance testing that allow teams to: work quickly and effectively; build excellent functional coverage for complex enterprise-scale systems; manage and maintain those tests in the face of change, and of evolution in both the codebase and the understanding of the business problem.\nThis talk answers the following questions, and more: How do you fail fast? How do you make your testing scalable? How do you isolate test cases from one-another? How do you maintain a working body of tests when you radically change the interface to your system?", "confName": "QCon, London 2016", "title": "Acceptance Testing for Continuous Delivery"}, {"url": "https://qconlondon.com/london-2016/presentation/funnelenterprise-monitoring-w-functional-streams.html", "abstract": "Scalaz-Stream (soon to be called \"FS2\" or \"Functional Streams for Scala\") is a library that lets us write compositional, modular, safe, and efficient asynchronous I/O using an expressive purely functional API. In this hands-on talk we'll see how to get started with the library, cook up some examples, and look at how we can combine functional streams into large distributed systems.", "confName": "QCon, London 2016", "title": "Compositional I/Î\u009f Streams in Scala"}, {"url": "https://qconlondon.com/london-2016/presentation/taming-failures-partitioning-time-and-space.html", "abstract": "For a service built to handle millions of requests/hour, it's insufficient to rely on latest trendy components or datastores to save you from system failures, instead it's necessary to deeply understand the properties and the mechanics of your system, and to partition its different dimensions to avoid a domino style failure cascade.\nPartitioning time is about uncoupling subsystems that don't absolutely need to be updated in sync, whereas partitioning space is achieved by separating subsystems that don't need to share their data.\nIn this talk we'll look at these and other design principles and how they were applied to build prismic.io, an API-based CMS platform.", "confName": "QCon, London 2016", "title": "Taming Failures by Partitioning Time and Space"}, {"url": "https://qconlondon.com/london-2016/presentation/ending-chain-blame-continuous-consequence.html", "abstract": "Any tech is well familiar with the frustration that, in corporate culture, there is often a long chain-of-blame, cascading down from corporates to the average team â\u0080\u0093 hiding behind finance.  At its worst it becomes a black hole where great ideas and initiatives silently dissolve.   But are things starting to changeâ\u0080¦.?  Is change really possible?\nIn this talk Katherine suggests it might, and explores how she is seeing an effect of the â\u0080\u0098Continuousness-trendâ\u0080\u0099 (continuous improvement, delivery, innovation etc etc) and how the cultural change we sometimes see might be down to an effect she calls â\u0080\u0098Continuous-Consequenceâ\u0080\u0099.\nHowever, she warns that in her experience this is a double edged sword: although â\u0080\u0098Continuousnessâ\u0080\u0099 brings in a useful data view of â\u0080\u0098cause and effectâ\u0080\u0099, in large corporations it can create hell-politics upstream that stick like mud and, surprisingly can sometimes cause unexpected negative outcomes.  Its not all rainbows!\nSo - in our corner of the world, how could we avoid the mud and how could we capitalize on the cultural effect â\u0080\u0098Continuousnessâ\u0080\u0099 has to our teamâ\u0080\u0099s advantage?  \nIn this talk, Katherine draws from her practical, recent on-the-ground experiences in multi-national large corporates, including a tough 200 people IT departmental merger to explain what she learned and what might help others â\u0080\u0093 and suggests some Eastern Philosophical models and lenses she found useful.", "confName": "QCon, London 2016", "title": "Ending the Chain-of-Blame: Continuous Consequence"}, {"url": "https://qconlondon.com/london-2016/presentation/continuous-acceleration.html", "abstract": "Software development has changed over the course of the last 10 years, becoming more and more reliant on external suppliers and open source providers. Modern software development is more akin to urban planning rather than building an individual building, where multiple teams collaborate to create a fully functioning software system.\nThis forms a supply chain that helps innovation happen faster. However, As innovation is accelerated, so too is application complexity. Complexity is the enemy of quality and productivity.\nAs recent highly published cases in the automotive industry have proven, not managing this chain of software can have disastrous outcomes. With more diverse teams specialising in certain fields, communication with tools and methods that disseminate relevant information to the right people at the right time becomes an absolute necessity.\nPoor communication and understanding between developers and teams creates poor quality. Poor quality creates unplanned break-fixes. Break-fixes create a drag on development speed. Itâ\u0080\u0099s a non-virtuous cycle.\nWhat if we could deliver applications on-time (even faster), on-budget (even more efficiently) and with a natural byproduct of increased transparency and less risk? The good news: other industries have done so with supply chain management.\nApplying supply chain approaches to software delivery raises the bar on delivering quality software faster and with managed risk.\nGet practical tips from the software supply chain playbook to:\n-Automate and quantify processes along the supply chain\n-Scrutinize the number and quality of your â\u0080\u009csuppliersâ\u0080\u009d\n-Improve traceability and visibility of deployed software\n-Manage out avoidable risk and bloat\n-Ensure prompt agile responses when things go wrong", "confName": "QCon, London 2016", "title": "Continuous Acceleration"}, {"url": "https://qconlondon.com/london-2016/presentation/cloud-based-microservices-powering-bbc-iplayer.html", "abstract": "In 2012 the system that got video into iPlayer was a monolith. In the nine months between Jan 2013 and Sept 2013 we replaced it with a new system we called Video Factory. It uses a microservices architecture and runs in AWS.\nVideo Factory has allowed us to more than double the amount of video available in iPlayer, extend availability from 7 days to 30 days and increase the amount of HD content by more than 700%. It also allows us to scale for sudden spikes in video going into iPlayer during events like Glastonbury and Wimbledon.\nAt the same time it has allowed us to move to a continuous delivery model and our developers can now deploy a component to live in under 15 minutes and perform dozens of live deployments every week.\nIn 2014 we started serving simulcast content (on-line versions of our TV channels) from Video Factory and during 2015 we moved radio content into this new system. For the first time unifying the BBC's systems for handling Audio and Video content online. We also added support for Podcasts, Audio and Video Clip Publishing, BBC Store and S4C. Recently we completely updated Video Factory to enable MPEG-DASH and add better support for HLS. This allows BBC iPlayer to make audio and video playable in modern browsers and Android devices without the need for Flash or Air.\nIn this talk Stephen Godwin describes how the BBC integrated its broadcast systems with AWS, how Video Factory is built around a microservices architecture that uses both REST and SQS and how this has allowed new features to be added and large changes to be made without interruption to the normal operation of iPlayer.", "confName": "QCon, London 2016", "title": "Cloud-based Microservices powering BBC iPlayer"}, {"url": "https://qconlondon.com/london-2016/presentation/quest-low-latency-concurrent-java.html", "abstract": "Concurrent programming with locks is hard. Concurrent programming without locks can be really hard. Concurrent programming with relaxed memory ordering and predictable latency is said to be only for wizards. This talk focuses on a decade long quest to discover algorithms which provide very high throughput while keeping latency low and predictable. Additionally, these algorithms and data structures need to provide real-time telemetry on how a system is performing via non-blocking operations.\nWe will cover some fundamental theory of concurrency and then compare various approaches to the same problem so that we can measure the impact on latency. We'll also show how some of these algorithm implementations get more interesting given the new features in Java 8.\nThis talk is aimed at programmers interested in advanced concurrency who want to develop algorithms with predictable response times at all levels of throughput which push our modern CPUs to the limit.", "confName": "QCon, London 2016", "title": "The quest for low-latency with concurrent Java"}, {"url": "https://qconlondon.com/london-2016/presentation/dark-art-container-monitoring.html", "abstract": "Containers are revolutionizing the way we deploy and maintain our infrastructures: reducing development overhead, streamlining dev / test / ops, and enabling highly scalable, dynamic infrastructures. But containers still have a key problem: monitoring and troubleshooting them is impractical, painful, and sometimes plain impossible. Even basic things like understanding what is using CPU, memory, or disk bandwidth inside a container are difficult - let alone finding out who a container is talking to on the network or tracking malicious activity.\nIn this presentation, we will cover the current state of the art for container monitoring and visibility, including real use-cases and pros / cons of each. We will then focus on advanced container visibility techniques, such as:\n\nvisualizing a containerâ\u0080\u0099s network activity\nunderstanding detailed resource usage (CPU, memory and disk I/O) of containers and individual processes running inside containers\nfollowing process and user activity inside containers\ncollecting logs from multiple containers\n\nThe presentation will feature live interaction with container environments and live demos of all tools and techniques discussed. Special emphasis will be put on sysdig, an open source container and system troubleshooting tool of which that the presenter is a core author.", "confName": "QCon, London 2016", "title": "The Dark Art of Container Monitoring"}, {"url": "https://qconlondon.com/london-2016/presentation/effortless-eventual-consistency-weave-mesh.html", "abstract": "We built Weave Net to make it easy to network your Docker containers however you like. At its core, Weave Net is powered by an eventually-consistent, partition-tolerant, completely decentralised mesh. We're packaging this technology as Weave Mesh, so that you can build your own distributed applications with the same simplicity and reliability as Weave Net. In this talk we will explain the theory behind Weave Mesh, some of the key features we learned were important, and demonstrate some exciting use-cases, like distributed caching and state replication.", "confName": "QCon, London 2016", "title": "Effortless Eventual Consistency with Weave Mesh"}, {"url": "https://qconlondon.com/london-2016/presentation/real-time-fraud-detection-graphs.html", "abstract": "Finance is awash with data, but much of it is discrete items locked up in silos waiting to be joined up to provide insights. Graph data is different: it's joined by default and oozes domain-specific insight.\nIn this talk we'll discuss several kinds of fraud common in financial services and see how each naturally decomposes into a straightforward graph use-case. To demonstrate the power of connected data, we'll explore use-cases using Neo4j and the (now open standard) Cypher query language to showcase just how performant, pleasant and powerful graphs can be, and how the fraudsters need to beware!", "confName": "QCon, London 2016", "title": "Real-Time Fraud Detection with Graphs"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/integrate-building-blocks-4-nextgen-iot-data-tiers.html", "abstract": "In 2016, it is expected that 6.4 billion connected â\u0080\u0098thingsâ\u0080\u0099 will be used worldwide growing to over 26 billion connected devices by 2020. Value will be gained from the extra data that is produced if it can be captured and analyzed in time. For example retailers might be able to mine new sorts of product usage data to increase sales whilst car manufacturers will be influenced by the mass of engine management information to create new value added services like engineering intervention.\nNew tools, methods and software stacks will be needed to support the development of applications to capitalize on this expected data deluge. Each element of such a processing stack will need to have a big data, parallel processing heritage and be well supported.\nDuring this discussion discover the building blocks, which can be used to develop and support business changing applications quicker and more effectively than your competition.", "confName": "QCon, London 2016", "title": "Integrate Building Blocks 4 NextGen IoT Data Tiers"}, {"url": "https://qconlondon.com/london-2016/presentation/netflixeverywhere-global-architecture.html", "abstract": "On December 24th, 2012 ASW US-EAST1 experienced a region-wide failure that took down the Netflix service for almost 24 hours. Knowing that failure is inevitable in any complex system we evolved our cloud-based, micro-service architecture to support multi-region traffic management and failover capabilities. With that foundation in place we drove initiatives to achieve service ubiquity and rapid global expansion. The overarching theme is #NetflixEverywhere - an amazing, global, highly available movie and TV streaming experience for any member, anytime, on any device, anywhere in the world.\nBuilding and evolving a pervasive, global service requires a multi-disciplined approach that balances requirements around service availability, latency, data replication, compute capacity, and efficiency. In this session, weâ\u0080\u0099ll follow the Netflix journey of failure, innovation, and ubiquity. We'll review the many facets of globalization then delve deep into the architectural patterns that enable seamless, multi-region traffic management, reliable, fast data propagation, and efficient service infrastructure. The patterns presented will be broadly applicable to internet services with global aspirations.", "confName": "QCon, London 2016", "title": "#NetflixEverywhere Global Architecture"}, {"url": "https://qconlondon.com/london-2016/presentation/how-will-persistent-memory-change-software-design.html", "abstract": "Byte-addressable Persistent Memory, in the form of a DIMM, is an emerging technology expected to soon have a dramatic and disruptive impact on server software. Usage of persistent memory as a storage replacement attached directly to a memory controller, requires a different approach to data handling within the kernel and applications that use it.\nIn this talk we will examine the primary differences between persistent memory, storage devices, and regular DRAM. We shall present how Persistent Memory is exposed to the OS with ACPI 6.0 extensions, and describe the resulting changes made upstream to the Linux kernel to provide direct access (known as \"DAX\" in Linux). Finally, an open source library, known as the NVM Library (http://pmem.io), providing persistent memory allocation, transactions, and other features useful to high-performance storage applications will be described.", "confName": "QCon, London 2016", "title": "How Will Persistent Memory Change Software Design?"}, {"url": "https://qconlondon.com/london-2016/presentation/patterns-containerized-world.html", "abstract": "Structuring and developing applications in a containerized world involves new challenges. Some best practices need to be adapted and new patterns evolve. In this talk Matthias LÃ¼bken will give an overview of typical patterns that he has seen in developing, deploying and operating applications that leverage containers.\nHe will start with defining best practices around a good modular container. He will than approach different composition strategies. The talk concludes in a first set of patterns like side-car / side-kick, ambassador, adapter and chains.\nAs containers are a fairly new concept for general purpose application development, this list is far from complete. This talk can be seen as a starting point for a general discussion about best practices and resulting patterns around containers.", "confName": "QCon, London 2016", "title": "Patterns in a Containerized World"}, {"url": "https://qconlondon.com/london-2016/presentation/distributed-systems-practice-theory.html", "abstract": "Modern systems in production rely on decades of computer science research. Over time, new architectural patterns emerge that enable more resilient and robust systems. In this talk, we'll discuss some of these patterns from systems I've worked on at Google and the related work that provide insights into the motivations behind them.", "confName": "QCon, London 2016", "title": "Distributed systems in practice, in theory"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/mens-sana-corpore-sano-optimising-mind-body.html", "abstract": "Our minds and bodies do not exist in isolation. Even the Romans knew that. What the Romans didn't know was how our modern lifestyles - especially in sedentary professions such as ours - would throw the balance between them into crisis! But when we talk about healthy lifestyles many people have a negative reaction. And no wonder! For years this label has been associated with miserable, restrictive, diets (which don't seem to work) and long hours of exhausting exercise (which doesn't seem to work). Is that really what we want to be doing with our lives?\nIt turns out it doesn't have to be like that. And there's no snake oil involved either! While it's still a quagmire of misinformation out there there is high quality information to be had. Sustainable, rewarding, changes to diet and vastly more efficient and effective ways to maintain good fitness levels are not only possible - but can directly impact our thinking ability and make us more productive as well!\nHow do I know all this? By applying all that I have learned to myself I lost over 50kg (around 8 stone, or 110 pounds) - going from almost morbidly obese to athletic - in just over a year: feeling better, getting sick less, and thinking more clearly - all while working long hours and raising a young family.", "confName": "QCon, London 2016", "title": "Mens Sana in Corpore Sano: Optimising Mind & Body"}, {"url": "https://qconlondon.com/london-2016/presentation/developing-social-recommendation-engine.html", "abstract": "In this session we'll build a recommendation engine from scratch while paying particular attention to the modelling choices made along the way. The data and use-cases will come from meetup.com's social gatherings.\nWe want to provide recommendations to attendees for finding interesting topics, groups to join and events to attend. For organizers it should help them find non-competing, optimal schedules, optimize their events and find potential members to reach out to.\nWe will import the data from meetup.com into our graph model and run Neo4j's Cypher graph queries to compute the content-based and collaborative filtering recommendations in real time. While doing that we'll observe how changes in the data affect the outcomes and which scores contribute to better results.\nThis session should provide you with enough hands-on knowledge to get started with Neo4j to import and query your own data for fun and profit.", "confName": "QCon, London 2016", "title": "Developing a Social Recommendation Engine"}, {"url": "https://qconlondon.com/london-2016/presentation/microsoft-clouds-frontdoor-building-global-api.html", "abstract": "All of Microsoft Azureâ\u0080\u0099s management API requests pass through a single â\u0080\u009cfrontdoorâ\u0080\u009d service that handles routing and common functionality. The frontdoor service proxies requests to over 50 different Microsoft products (SQL, Virtual Machines, Dynamics, Active Directory, etc.) and is a mainline dependency for all service provisioning and management. As a result, downtime must be avoided at any cost and the APIs needs point of presence throughout the globe. Previously, this service was deployed to only a single geographic region, which caused three problems: (1) it hurt performance for our large international customer base; (2) it introduced a single point of failure; and (3) it would make metadata for other regulatory areas pass through the United States.\nOver the past few years, Microsoft has transitioned to a fully geo distributed deployment for this frontdoor service (present in 20+ datacenters in North & South America, Europe, Asia and Australia). In each major area, there are multiple active datacenters that can automatically handle failovers due to physical or software faults. All metadata is also replicated using a simple table store that handles multi-master writes and asynchronous replication. This data store uses simple / common components (key/value store + queues) to appear consistent to our customers but is incredibly resilient to any number of common faults.\nThis session will cover the process of moving to this geo-distributed architecture, as well as relatable techniques for achieving high availability (via active-active-active deployments). The techniques should be transferable to public or private clouds.", "confName": "QCon, London 2016", "title": "Microsoft Cloud's Frontdoor: Building a Global API"}, {"url": "https://qconlondon.com/london-2016/presentation/game-performance-song-jit-and-gc.html", "abstract": "In this session attendees will learn about various JIT Compiler and Runtime optimizations in OpenJDK HotSpot as well as the inner workings of Garbage Collectors (GC) in OpenJDK HotSpot. The optimizations covered in this talk will have a common theme of \"optimizing for the metal\"", "confName": "QCon, London 2016", "title": "Game of Performance: A Song of JIT and GC"}, {"url": "https://qconlondon.com/london-2016/presentation/observe-enhance-control-vms-containers.html", "abstract": "Operationally, many of the problems we're solving for containers have long been solved for VMs. However, these solutions don't quite fit the container model and require a new perspective and implementation. In this talk, we take a look at the theme of this track \"Observe, Enhance, Control\" and see how this related to VMs, what solution architectures worked there, and discuss why these architectures are no longer adequate in a containerized world.\nWe'll then look at how these same problems are being solved today, and look to the future of how we can expect similar problems to be solved as the container world matures.", "confName": "QCon, London 2016", "title": "Observe, Enhance, & Control: VMs to Containers"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/bitcoin-security-110th-cent-billion-dollars.html", "abstract": "Bitcoin allows for new applications that utilize programmatic nanopayments smaller than a penny. Alternatively, bitcoin also allows millions of dollars to be stored on a flash drive, on a piece on paper, or in a passphrase. These disparate ways of using the same underlying bitcoin protocol require vastly different security models.\nThis talk explores micropayment and wealth storage use cases for bitcoin and examines the various novel cryptosystems used to facilitate micro-penny payments and secure billions of dollars in global bitcoin banks.", "confName": "QCon, London 2016", "title": "Bitcoin Security: 1/10th cent to a billion dollars"}, {"url": "https://qconlondon.com/london-2016/presentation/lead-revolution-being-ordinary.html", "abstract": "Rock star developers, charismatic leaders, star players, genius specialists, baby-faced risk takers... just put them in a room, add agility and press go â\u0080\u0093 right? If youâ\u0080\u0099ve ever tried to do it, you know the results are as about as successful as egotistical scientists collaborating themselves out of a paper bag.\nSo how do we operate effectively in this crazy environment? How can we make great decisions? How do we deal successfully with big egos and political hell? Playing politics and stroking egos is out â\u0080\u0093 being authentic is in. Consider: Innovation is our industryâ\u0080\u0099s primary nirvana but at speed it can make any genius a babbling-has-been in seconds. Our industry now changes at a rate so fast we donâ\u0080\u0099t even have time to laud our achievements over each other before weâ\u0080\u0099ve already become 2nd in line.\nKatherine puts forward her experience that, in reality, what has really been most successful for individuals in our rapidly ever-changing landscape is.... being ordinary. As much as possible.\nIn fact, recent trends in magazines like Harvard Business Review, Forbes and Fortune are recently overflowing with research, articles and conjecture about â\u0080\u0098a new radical leadershipâ\u0080\u0099 like â\u0080\u0098being humbleâ\u0080\u0099, â\u0080\u0098authenticâ\u0080\u0099, quiet and data driven.\nBut how does that really work, on the ground...?\nIn this entertaining talk, Katherine shares real life, practical steps and techniques (inspired from 2,500 year old Eastern Philosophical models) that she's successfully used - fresh from this last year â\u0080\u0093 to help solve tough tech people issues with teams, executives and divisions who have been going through painful change from mergers to highly stressful crucially inter-dependent hell.", "confName": "QCon, London 2016", "title": "Lead the Revolution by Being Ordinary"}, {"url": "https://qconlondon.com/london-2016/presentation/messaging-microservices-and-streaming-data.html", "abstract": "Microservices need to be loosely coupled, and we know that messaging good for that, so why are there so many services communicating exclusively over HTTP? In this session we look at how to turn the tables and use messaging where it is appropriate with the minimum possible fuss using Spring Cloud Stream. While developing a sample application, you'll also see it deployed as part of a larger distributed system using Spring Cloud Data Flow (the new manifestation of Spring XD), which unifies streaming and batch operations. You'll learn about this new Spring Cloud project and how simple it is to build event driven and streaming applications.", "confName": "QCon, London 2016", "title": "Messaging Microservices and Streaming Data"}, {"url": "https://qconlondon.com/london-2016/presentation/ecs-docker-secure-async-execution-coursera.html", "abstract": "While most business logic can run in response to web requests, some computations require more than 200ms to complete. Although developers have a cornucopia of web frameworks to choose from, relatively little investment has been made in general purpose systems for delayed execution.\nCourseraâ\u0080\u0099s general purpose nearline execution frameworkâ\u0080\u0094IguazÃºâ\u0080\u0094has seen broad utility across many aspects of our global learning platform. Built upon containers and optimized for developer productivity, we use this system to handle researcher data exports, broadcast announcements, and peer reviewer matching. A secured instance of IguazÃº is used to safely evaluate programming assignment submissions for a variety of courses and programming languages.\nTogether, we will trace Courseraâ\u0080\u0099s journey from PHP to the JVM to Docker. This talk will cover aspects of Courseraâ\u0080\u0099s architecture that enables us to rapidly build sophisticated features for our learning platform. Additionally, we will discuss our experience running containers in production; what works, what doesnâ\u0080\u0099t, and why. Finally, we will briefly touch upon container threat models, and how to architect a defense-in-depth strategy to mitigate both known and unknown vulnerabilities.", "confName": "QCon, London 2016", "title": "ECS & Docker: Secure Async Execution @Coursera"}, {"url": "https://qconlondon.com/london-2016/presentation/understanding-hardware-transactional-memory.html", "abstract": "Hardware Transactional Memory (HTM) is here. Again. It has finally become a common feature in commodity server hardware platforms. But what will we do with it? This session will explore the underlying mechanics that power HTM on current platforms, focusing on things developers need to understand when contemplating the use of HTM in new and existing code. We will discuss and demonstrate new speculative and optimistic locking mechanisms enabled by HTM, cover benefits and limitations, and speculate (pun intended) about both the near term and long term future impact of HTM on concurrency choices and everyday programming choices.", "confName": "QCon, London 2016", "title": "Understanding Hardware Transactional Memory"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/not-quite-so-broken-tls-using-unikernels.html", "abstract": "Much cloud infrastructure consists of small microservices that interoperate via standard protocols as HTTPS. Unikernels are a new technique that specialises the deployed service into a tiny, domain-specific kernel that eliminates any unnecessary pieces and runs in a single address space. Some unikernels (such as MirageOS) even offer full memory safety down to the device drivers, and can run on tiny ARM devices as well as cloud hypervisors.\nTooling for unikernels is still nascent, but advancing fast. One of their key advantages is that the innards of the service is no longer a mystery novel. Instead, every single component is exposed as a library, and can be manipulated and monitored easily.\nIn this talk, I'll deep dive into the adventures we went through to rebuild the TLS protocol using the latest unikernel techniques. This is a clean-slate reimplementation that required first figuring out what the real-world protocol specification actually is, with testing oracles and sacrificial infrastructure to refine it. The result is a satisfying tiny unikernel that is a fully type-safe implementation that interoperates with existing TLS implementations.", "confName": "QCon, London 2016", "title": "Not quite so broken TLS using Unikernels"}, {"url": "https://qconlondon.com/london-2016/presentation/building-modern-security-engineering-team.html", "abstract": "Continuous deployment and the DevOps philosophy have forever changed the ways in which businesses operate. This talk with discuss how security adapts effectively to these changes, specifically covering:\n\nPractical advice for building and scaling modern application and infrastructure security programs\nLessons learned for organizations seeking to launch a bug bounty program\nHow to run realistic attack simulations and learn the signals of compromise in your environment", "confName": "QCon, London 2016", "title": "Building a Modern Security Engineering Team"}, {"url": "https://qconlondon.com/london-2016/presentation/engineering-you.html", "abstract": "What are the characteristics of a good software engineer? It's a topic many people would argue endlessly about. This is not surprising given we are effectively living in the era of software alchemy.\nSome of the best programmers draw on strong scientific and engineering background and combine this with craft like coding skills in a virtuous feedback cycle. In this talk we explore the individual practices and techniques that can help bring out the engineer in you.", "confName": "QCon, London 2016", "title": "Engineering You"}, {"url": "https://qconlondon.com/london-2016/presentation/real-world-cd-pipelines.html", "abstract": "Do you often look at example CD pipelines and think \"If only our process were that simple\"? Do you need to separately build multiple modules / components and then assemble them into a release? Does your unit of release need to contain more than just a single application? Are these delivered by multiple teams? How do you go about assembling these parts and then putting them through a pipeline to validate and deploy the whole assembly? And what about version numbers - do you version the components? Do you version the whole stack at release time? How should you go about implementing these requirements? In this session I will show a typical Fan-In pattern.\nI will show how you can use Jenkins pipelines to build component and assembly pipelines. I will also show various techniques for managing the assembly manifest and triggering assembly pipelines on demand, on schedule and via upstream triggers.", "confName": "QCon, London 2016", "title": "Real-world CD Pipelines"}, {"url": "https://qconlondon.com/london-2016/presentation/architecting-google-docs.html", "abstract": "Micah Lemonik of Google NYC will discuss the challenges of building behaviorally complex products and realtime state management systems at a global scale.\nLearn about the architectural history of Google Docs and how we build the worlds largest real time collaboration platform and how we make that platform available to developers.\nSome of the things covered:\n\nMaking realtime collaboration on any document type work\nMaking a word processor and spreadsheet in a browser\nBuilding scalable distributed systems that need to support a large amount of object state and non-idempotent / non-commutative messaging\nArchitecting Google Drive's realtime SDK", "confName": "QCon, London 2016", "title": "Architecting Google Docs"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/containers-change-everything.html", "abstract": "We all believe that Docker will revolutionise deployment, but what about the architectural impact of containers? What do modern container schedulers mean for resilience, redundancy and server density? Are we entering an age of real-time operations? Is a second the new minute?", "confName": "QCon, London 2016", "title": "Containers Change Everything"}, {"url": "https://qconlondon.com/london-2016/presentation/distributed-consensus-making-impossible-possible.html", "abstract": "In this talk, we explore how to construct resilient distributed systems on top of unreliable components.\nStarting, almost two decades ago, with Leslie Lamportâ\u0080\u0099s work on organising parliament for a Greek island. We will take a journey to todayâ\u0080\u0099s datacenters and the systems powering companies like Google, Amazon and Microsoft. Along the way, we will face interesting impossibility results, machines acting maliciously and the complexity of todayâ\u0080\u0099s networks.\nUltimately, we will discover how to reach agreement between many parties and from this, how to construct new fault-tolerance systems that we can depend upon everyday.", "confName": "QCon, London 2016", "title": "Distributed Consensus: Making Impossible Possible"}, {"url": "https://qconlondon.com/london-2016/presentation/automating-security-slack.html", "abstract": "Monitoring for potentially malicious activity in an environment and handling the resulting alerts is vital to the success of a defensive security program. Powerful centralized logging is accessible to all of us, but it is only useful if we understand and take action on the data collected.\nHow do we also ensure that we have eyes on potential issues while keeping noise to a minimum? What tools and techniques can we use to enhance the effectiveness and responsiveness of a security team?\nWe will discuss some of the ways Slack approaches collecting, inspecting, and communicating security information to the security team and to the individuals in our organization. We will also demonstrate how integrating security into a communication platform helps us look at more data by delegating event management to the affected individuals.", "confName": "QCon, London 2016", "title": "Automating Security at Slack"}, {"url": "https://qconlondon.com/london-2016/presentation/burnout.html", "abstract": "Over the past few years, there seems to have been an increase in suicides in our sector of the IT industry. With complexity and responsibility ever increasing in the creation and support of digital services industries, we have seen a correlated increase in stress levels. We have come to know this as a term we call â\u0080\u009cBurnout.â\u0080\u009d Burnout was coined by German-American psychologist Herbert Freudenberger in 1974. The Japanese have a word for burnout that leads to death -- \"karoshi.\" When suicide is involved they call it \"karojisatsu.\" In this presentation, we are going to break down what we know about Burnout. We will look at some survey data and try to suggest some ways to achieve healthier outcomes for ourselves and our colleagues.", "confName": "QCon, London 2016", "title": "Burnout"}, {"url": "https://qconlondon.com/london-2016/presentation/enterprise-integration-past-present-and-future.html", "abstract": "Many things have changed over the last 10 years. The next 10 years will be no different. Though some key concepts such as integration are very unlikely to dramatically change, it doesnâ\u0080\u0099t mean the systems you build today will last for decades either.\nAs a vendor, we have seen many customers at various levels of maturity. While some organizations have kept legacy baggage going for decades, others have kept iterating to a level where they are never outdated. There is a fine line however, between innovation and stagnation where you spend the least and gain the most.\nThis talk focuses on key lessons learnt from the successes and failures of others. Weâ\u0080\u0099ll present case studies from various industries to understand the past, present and future of enterprise integration, and how to find the fine line of iterative improvement that best suits the kind of business you are in.", "confName": "QCon, London 2016", "title": "Enterprise Integration: Past, Present and Future"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/much-faster-networking.html", "abstract": "The bandwidth available on our network links has been growing much more rapidly than the performance of our CPU cores. In response, the host network stack has seen a great deal of innovation.\nThis session will cover the technologies that make very high performance networking possible on commodity servers and networks, with a special focus on kernel bypass technologies including sockets acceleration and NFV (Network Functions Virtualization).\nThese techniques give user-space applications direct access the network adapter hardware, making possible sub-microsecond latencies and millions of messages per second per thread.", "confName": "QCon, London 2016", "title": "Much Faster Networking"}, {"url": "https://qconlondon.com/london-2016/presentation/build-ship-and-run-unikernels.html", "abstract": "Automation, repeatability, reliability and testing are the basis of the ability to move fast in software. Over the years, we lost control and let our software environments turn into overweight pets, and then gradually replicated these into overweight cattle. The new focus on microservices and containers is sweeping this away, and we are focusing on total control over the development process, traceability of artefacts, and security in deployment. The natural outcome of this is that we will end up developers specifying the totality of their application in production, breaking apart the old distinction between the operating system and the application.\nUnikernels are these production artifacts, the butterflies of the microservice world, specialised to perform a single function fleetingly. In this talk I look at our build, ship and run pipelines and how the changes we are seeing lead to unikernels in production.", "confName": "QCon, London 2016", "title": "Build, Ship and Run Unikernels"}, {"url": "https://qconlondon.com/london-2016/presentation/goshawkdb-making-time-vector-clocks.html", "abstract": "It's well understood how logical clocks can be used to capture the order in which events occur. By extension, vector clocks encode when an event occurred across a distributed system. GoshawkDB reverses this idea: by analysing the dependencies between transactions, each participant calculates a vector clock that captures the constraints necessary to achieve strong serializability. The vector clocks from the different participants in a transaction can then be combined safely using the same techniques as CRDTs. This allows GoshawkDB to achieve strong serializability without imposing a total global ordering on transactions.\nIn this talk I will demonstrate these algorithms: what dependencies do we care about between transactions, how can we capture these with Vector Clocks, how we can treat Vector Clocks as a CRDT, and how GoshawkDB uses all these ideas and more to achieve a scalable distributed data store with strong serializability, general transactions and fault tolerance.", "confName": "QCon, London 2016", "title": "GoshawkDB: Making time with Vector Clocks"}, {"url": "https://qconlondon.com/london-2016/presentation/nihilist%E2%80%99s-guide-wrecking-humans-and-systems.html", "abstract": "The fault of the computer system is that it can only follow instructions. The fault of the human is that it can only make judgement calls. When we think about this in relation to information security, it presents an interesting opportunity to destructively combine the two and use it for evil.\nWe often assume that out of all the elements within our organisations and systems, people are most likely to expose us to risk. People create technical systems and people man these systems. The problem? We almost always focus on human and technical threats as separate risks and donâ\u0080\u0099t consider the harm that can be done when combined.\nTogether, we will explore how social engineering can be used in conjunction with technical attacks to create sophisticated and destructive attack chains, share some real world scenarios and talk about what weâ\u0080\u0099re doing wrong to protect against these threats. We will show you how a seemingly innocent phone call can lead to complete internal network compromise, how a purposely bad phishing email can be utilised to your benefit, and how people are generally bad at trust and computers.", "confName": "QCon, London 2016", "title": "Nihilistâ\u0080\u0099s Guide to Wrecking Humans and Systems"}, {"url": "https://qconlondon.com/london-2016/presentation/making-sandwich-effective-feedback-techniques.html", "abstract": "Feedback is one of the most important skills when collaborating with others. Giving and receiving feedback with honesty, integrity and empathy is hard. Doing so consistently takes practise and requires learning and practising feedback and listening techniques.\nIn this session, Dan discusses a number of feedback models and techniques and shows you where and how you can apply them. He explains the infamous and much-misunderstood â\u0080\u009csandwich modelâ\u0080\u009d of feedback, how it works and why it usually doesnâ\u0080\u0099t, and looks at some of the failure modes of feedback. Are you using feedback to help your colleagues and yourself to grow, or are you using it to coerce and control them? How do you know? And what does any of this have to do with Systems Theory?\nAfter this session you will be better equipped to offer feedback, more resilient when receiving feedback, and maybe more aware of your own motivations for doing so.", "confName": "QCon, London 2016", "title": "Making a Sandwich: Effective Feedback Techniques"}, {"url": "https://qconlondon.com/london-2016/presentation/have-your-cake-eat-it-microservices-monorepos.html", "abstract": "The term \"Microservice Architecture\" has sprung up over the last few years to describe a particular way of designing software applications as suites of independently deployable services. (Martin Fowler).\nThe term MicroServices describes the componentisation of a complex deployment architecture into smaller independent deployable units that can be independently updated and scaled. The source of each component often winds up in its own repository, leading to what is often described as a repository sprawl with loss of visibility across the whole architecture code base and reduced security.\nAnother popular trend is the return to monorepos, providing a single repository for all components, exactly to counterbalance the draw-backs of the repository sprawl. Monorepos have their own draw-backs, since they force each developer to pull the entire codebase. Come to this talk how you can solve the conundrum and have your cake and eat it.", "confName": "QCon, London 2016", "title": "Have your cake & eat it: MicroServices & Monorepos"}, {"url": "https://qconlondon.com/london-2016/presentation/building-trust-machines-using-block-chain.html", "abstract": "We reap massive benefits from working together. But since the early days of our societies, trust boundaries between individuals, businesses, institutions and governments prevent us from collaborating and dealing freely with each other. In order for such economic actors to engage in economic activity with each other, they must cross these trust boundaries â\u0080\u0093 invisible boundaries stemming from the risk that interests of actors that do not otherwise know each other are not aligned which are often prohibitively expensive to cross.\nThe blockchain can be seen as the core of a trust machine that people can use cheaply to replace the human and labor intensive processes we have employed so far in order to overcome trust boundaries.\nIn this talk we will discuss how and why blockchain works so well and show how it can be generalised well beyond its existing well known domains like payments, to allow many new and exciting types of distributed collaboration.", "confName": "QCon, London 2016", "title": "Building Trust Machines using the Block Chain"}, {"url": "https://qconlondon.com/london-2016/presentation/using-pony-fintech.html", "abstract": "Pony is a new actor-model language that's statically typed and ahead-of-time compiled (using LLVM), with a fully concurrent garbage collector and a data-race free type system. But this talk isn't about language features - it's about using Pony in a fintech environment to build high-performance tools.\nWhat are some good design patterns?\nWhat's the worst thing you can do to the Pony garbage collector?\nWhat's the real cost of a message send?\nWe'll cover the runtime in depth.", "confName": "QCon, London 2016", "title": "Using Pony for Fintech"}, {"url": "https://qconlondon.com/london-2016/presentation/meet-nodejs-anti-patterns.html", "abstract": "As Node continues to go from strength to strength, being widely adopted not only within the startup community but more and more by the Enterprise community, a number of anti-patterns are beginning to emerge.\nThis talk focuses on the strengths of JavaScript in the Enterprise by trying to isolate the anti-patterns that are slowly beginning to emerge.", "confName": "QCon, London 2016", "title": "Meet the Node.js anti-patterns"}, {"url": "https://qconlondon.com/london-2016/presentation/startup-ml-bootstrapping-fraud-detection-system.html", "abstract": "Stripe processes billions of dollars a year for businesses around the world. To protect its users from fraud, Stripe employs machine learning to detect potentially fraudulent transactions. In this talk, I'll describe how we bootstrapped this system and some of the most important aspects of industrial machine learning. We'll talk about how to choose, train, and evaluate models, how to bridge the gap between training and production systems, and how to address common pitfalls using the problem of fraud detection as our motivation. By the end of the talk, you should be familiar with many of the core concepts in practical machine learning: regression, random forests, training and validation sets, ROC and AUC curves, and production scoring, monitoring, and evaluation.", "confName": "QCon, London 2016", "title": "Startup ML: bootstrapping a fraud detection system"}, {"url": "https://qconlondon.com/london-2016/presentation/test-driven-microservices-system-confidence.html", "abstract": "Tests should speed you up not slow you down, and nowhere is this more important than when building micro service-based systems where speed of delivery and adaption is, often, everything.\nIn this talk Russ Miles will show how you can build production-level confidence in your polyglot microservices by applying the test-driven approach to synchronous (REST) and asynchronous (Messaging) services. In a massively distributed system such as microservices there are a lot of variables at play and this could be a real headache for testing. At the same time testing is critical to having the confidence to take advantage of the speed of adaption that the microservice-based approach promises.\nWith a selection of demonstrations and code snippets (along with a little guitar thrown in for good measure!), Russ will show that with the right approach to testing and deploying you can have confidence in your individual microservices AND in having the right impact on the surround system.\nTaking a technical dive theyâ\u0080\u0099ll show how by applying specific constraints to the system, testing not only can be successfully applied to the microservices themselves but that this can be done simply, easily and can embrace speed of change rather than be an impediment.", "confName": "QCon, London 2016", "title": "Test-Driven Microservices: System Confidence"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/why-initiative-not-strategy.html", "abstract": "Are you currently facing a mobile-, cloud-, micro service-, API-initiative? You probably have a SWAT- or special team to run these projects. Do you have to integrate them into your IT landscape? â\u0080¦ and does it work? In the last years we have seen many examples around new technologies and channels that reshaped the market landscape. In this session we will investigate initiatives from the banking and retail industry to find out what is essential, which key ingredients made an initiative work and what you should avoid in your strategy.", "confName": "QCon, London 2016", "title": "Why Initiative is not a Strategy"}, {"url": "https://qconlondon.com/london-2016/presentation/hacking-bank-mobile-apps.html", "abstract": "What do you do when you want a fully transactional banking API but PSD 2 is years away and you doubt that banks will ever make a good faith effort to ship a usable API anyway? You attack the bank's own mobile app and reverse engineer its API, that's what.", "confName": "QCon, London 2016", "title": "Hacking bank mobile apps"}, {"url": "https://qconlondon.com/london-2016/presentation/rust-systems-programming-everyone.html", "abstract": "Rust is a new programming language that provides memory safety and data-race freedom while offering efficiency and low-level control comparable to that of C and C++. Rust allows for safe systems programming, including concurrent threads with shared data.\nI will describe the core concepts of the Rust language (ownership, borrowing, and lifetimes), as well as the tools beyond the compiler for open-source software component distribution (cargo, crates.io).\nThese pieces, along with the continued work of Rust's volunteer community, have led so-called \"script programmers\" to discover systems programming in a hands-on fashion, expanding both their own skill set, and also the Rust ecosystem as a whole.", "confName": "QCon, London 2016", "title": "Rust: Systems Programming for Everyone"}, {"url": "https://qconlondon.com/london-2016/presentation/hash-histories-toy-blockchains-great-danger.html", "abstract": "Document Coin uses a simple hash history algorithm to track coin provenance. Coin content is secured with cryptography but the history is secured with a hash of the cleartext content. We'll follow the JavaScript cryptography code line by line, using HTML5 Web Crypto APIs and IETF standardized JSON signature formats.\nCoins also carry a copy of the signers public key which makes sybil attacks frictionless unless we take care which pubic keys we believe, so in a full implementation, identity will also be signed by subsequent coin holders, coloring the identity assertion with each transaction.\nExpect slides with JSON on them, and JavaScript over-the-shoulder test/dev iterations using Prova in the browser.", "confName": "QCon, London 2016", "title": "Hash Histories - toy blockchains for great danger"}, {"url": "https://qconlondon.com/london-2016/presentation/mechanics-testing-large-data-pipelines.html", "abstract": "Applied machine learning data pipelines are being developed at a very fast pace and often exceed traditional web/business applications codebase in terms of scale and complexity. The algorithms and processes these data workflows implement fulfill business-critical applications which require robust and scalable architectures. But how to make these data pipelines robust? When the number of developers and data jobs grow while at the same time the underlying data change how do we test that everything works as expected?\nIn software development we divide things in clean, independent modules and use unit and integration testing to prevent bugs and regression. So why is it more complicated with big data workflows? Partly because these workflows usually pull data from dozens of sources out of our control and have a large number of interdependent data processing jobs. Also, partly because we don't know yet how to do or lack the proper tools.\nThis talk will explore the mechanics of testing large, complex data workflows and identify the most common challenges developers face. We'll look at good practices how to develop unit, integration, data and performance testing for data workflows. In terms of tools, we'll look at what exists today for Hadoop, Pig and Spark with code examples.", "confName": "QCon, London 2016", "title": "The mechanics of testing large data pipelines"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/hunting-unicorns-quest-modern-agile.html", "abstract": "Beyond Agile myths and legends, in a land far far away, a few valiant developers still practice XP - melding an old world Agile approach with cutting edge lean product techniques. Our teams have been using XP for the last decade and we continue to evolve our practice. Come to this talk to hear tales of our XP journey and how we have evolved from basic XP into a high functioning lean product development environment.\nYou will learn about modern approaches that you can apply in your own environment such as: Testing-In-Production, Mob Programming and more!", "confName": "QCon, London 2016", "title": "Hunting Unicorns - The Quest for Modern Agile"}, {"url": "https://qconlondon.com/london-2016/presentation/cassandra-response-time-sensitive-environments.html", "abstract": "Cassandra is often used in environments where responsiveness is important. This session will discuss common challenges and concerns around response time sensitive deployments. Including Java's infamous GC behavior and things that can be done to address it. We will describe some patterns found in real world implementation, and demonstrate proven ways to contain and control response time behavior in Cassandra environments.", "confName": "QCon, London 2016", "title": "Cassandra in Response Time Sensitive Environments"}, {"url": "https://qconlondon.com/london-2016/presentation/how-data-science-going-improve-insurance.html", "abstract": "The insurance industry is well-known for taking a conservative approach to integrating new technologies. This is a sensible way of mitigating unknown operational risks, but ironic since the very heart of insurance is statistics and data analysis. Large scale data processing and machine learning is now surging into every aspect of modern business and the insurance industry has a place leading the charge.\nIn our talk we will describe 3 real-world projects that we have undertaken to enable insurance clients to learn from their data, improve their product-market fit and improve their business processes. Each project contains a different and interesting angle on data acquisition, processing and modelling, and as practitioners we get our hands dirty coding so will demonstrate some code and systems.", "confName": "QCon, London 2016", "title": "How is Data-Science Going to Improve Insurance?"}, {"url": "https://qconlondon.com/london-2016/presentation/successful-go-program-design-6-years.html", "abstract": "Go has emerged from its infancy, and is now one of the preÃ«minent languages in the server, microservice, and infrastructure space. This talk collects lessons learned from 6 years of professional Go development, highlighting the idioms, design patterns, and practices that have proven themselves at scale â\u0080\u0094 and many that haven't. Attendees will leave with a stronger understanding of what good Go code looks like, and with strategies to improve their own Go projects.", "confName": "QCon, London 2016", "title": "Successful Go program design, 6 years on"}, {"url": "https://qconlondon.com/london-2016/presentation/js-everywhere.html", "abstract": "JavaScript on browsers, on smartphones, on servers, on physical devices. In the Internet of Things, the benefits of a single language platform are quite compelling: coding with the same libraries and frameworks (even for embedded developmaent), but deploying on different platforms. How can we build an Enterprise Internet of Things application based on all of these? What patterns should we follow? In this talk I will present an approach combining robotics, REST APIs, MicroServices, a Frontend UI and the MQTT protocol.\nThe rise of JS robotics (Johnny-Five, Cylon.js) made it possible to control the real world with JavaScript. Raspberry Pi, Intel Edison and Tessel are just a few of the boards that are supported. Fully isomorphic (or universal) libraries like MQTT.js, can run on these devices, in the browsers, or on servers. Thanks to advancements in JavaScript engines over the last ten years, we can also write highly performant servers to glue everything together.", "confName": "QCon, London 2016", "title": "JS Everywhere"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/microservices-and-devops-journey.html", "abstract": "Switching from a monolithic to a microservices architecture is no easy task. At Wix, it was a 5 year journey, but we now have over 200 microservices successfully running on a battle-tested production environment.\nI will share what we learned as we worked toward this milestoneâ\u0080\u0094how microservices and DevOps go hand in hand, and what it takes to operate and build a successful microservices architecture from development to production.", "confName": "QCon, London 2016", "title": "The Microservices and DevOps Journey"}, {"url": "https://qconlondon.com/london-2016/presentation/learningishorrible-and-other-harsh-realities.html", "abstract": "It is an implicit reality of the Agile Manifesto that we need to accept being wrong, yet people hate to be wrong. Iâ\u0080\u0099ve asked lots of rooms of lots of people to describe what it feels like to be wrong, and the response fall into a narrow range: Embarrassing. Depressing. Humiliating. All sort of variations on Bad.\nThis is an existential challenge to Agile. If there's anything people can agree on about the agile manifesto is that it is about people, and about the inability to perfectly predict the future. It gets worse: \"bad\" is not what being wrong feels like. Being wrong feels great! Thatâ\u0080\u0099s because being wrong feels exactly like being right. What feels terrible is when you learn you were wrong. But if I ask these same people if they like to learn, they claim that they do, even though they just describe the feeling of learning as horrible. Whatâ\u0080\u0099s going on here? To be a fully capable member of an agile team â\u0080\u0094 learning, communicating, and collaborating â\u0080\u0094 means overcoming the harsh realities that work against us. We are subject to many cognitive biases, predictable gaps between perception and reality. We have limited cognitive energy. We are adept at spotting mistakes in others that we are blind to in ourselves. You might attend this talk if you are curious how human psychology works against successful agile adoption. But my real goal is to change your behavior. My experience is that seeking excellence in agile development requires difficult emotional work. I will challenge you to reconsider your accountability for failure and frustration, and invite you to establish the habits and patterns that can lay the groundwork for success. They are simple, but not easy. Are you up for it?", "confName": "QCon, London 2016", "title": "#LearningIsHorrible, and Other Harsh Realities"}, {"url": "https://qconlondon.com/london-2016/presentation/data-movement-patterns-internet-things.html", "abstract": "The Internet of Things increases the data movement challenge by orders of magnitude. How will all these â\u0080\u009cThingsâ\u0080\u009d be connected? How will we pick the best data movement pattern? What considerations are there apart from performance? This session will discuss the impact of IoT on data movement, characterise some challenging scenarios and introduce methods for structuring requirements and specifications for data movement architectures.", "confName": "QCon, London 2016", "title": "Data Movement Patterns for The Internet of Things"}, {"url": "https://qconlondon.com/london-2016/presentation/fighting-fintech-wave-devops.html", "abstract": "Commentators everywhere are predicting the death of incumbent financial institutions in the face of competition from new, lean, agile entrants to their markets. But the â\u0080\u009coldâ\u0080\u009d institutions are waking up to the threat and realising that they too can move quickly when they see a threat to their businesses. One of the weapons many see as key in this fight is the use of DevOps to power agile change.\nDevOps is about breaking down the siloed, process driven approach to software delivery in favour of a leaner and more collaborative way of working, whilst leveraging automation to reduce the time it takes to deliver code from development into production.\nAs the competitive landscape is changing, DevOps initiatives are gaining real traction within banks and financial services firm as the industry increasingly feels the need to reinvent itself and drive agility in order to combat #fintech type disruption. In this presentation, we will begin by considering where financial services organisations are typically effective, well placed, or have a head start on their DevOps transformation. The degree of readiness might surprise you, as my experience has shown that in many ways, banks are surprisingly and increasingly DevOps mature relative to other industries.\nWe will then focus on where banks have lower maturity and more challenging work to do on their DevOps transformation. This will incorporate lots of actionable advice, as I believe that incumbent financial service providers need to more aggressively adopt the patterns that have emerged from the DevOps community in order to remain relevant.\nThe session will incorporate a number of experience reports and case studies from my DevOps transformation work across banking and financial services. DevOps is easy in theory - it's when the rubber hits the road that things get interesting!", "confName": "QCon, London 2016", "title": "Fighting the #fintech Wave with DevOps"}, {"url": "https://qconlondon.com/london-2016/presentation/open-source-swift-under-hood.html", "abstract": "Swift was released as open-source in December 2015 and has continued to grow since its release. Now that Swift is available on Linux as well as OSX and iOS, what can you do with it? In this presentation, weâ\u0080\u0099ll look at the open-source project, how applications and libraries can be built for both platforms, the differences between the different builds and how Swift works under the hood.", "confName": "QCon, London 2016", "title": "Open Source Swift Under the Hood"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/applied-supervised-learning-predicting-recidivism.html", "abstract": "People who repeatedly cycle through the criminal justice system, often for low-level crimes, cost the country millions of dollars in time and effort, but little is known about them. Who are these repeat offenders, and what drives their recidivism? Can we predict who they are to intervene before they enter the vicious cycle of recidivism?\nThe steps to build a predictive model may vary by project, but the fundamental workflow and principles remain the same. This talk will walk through the process from the beginning to end: data preparation, variable definition, visualization, model fitting, and robustness testing. As a case study, we will discuss a project completed by a group of pro bono data scientists at a charity called DataKind. In partnership with the Laura and John Arnold Foundation, the DataKind team built a predictive model to identify the criminals most likely to reoffend in order to better address the risk factors and offer appropriate interventions and services.\nThrough examples of techniques used and challenges faced during this project, the presentation will point out potential pitfalls and implicit assumptions in various models, with code snippets in R and Python.\nThis session is suitable for those with a limited background in statistics and data science.", "confName": "QCon, London 2016", "title": "Applied Supervised Learning: Predicting Recidivism"}, {"url": "https://qconlondon.com/london-2016/presentation/microservices-chaos-testing-jet.html", "abstract": "Some of the biggest growing pains we've experienced with our microservice architecture at Jet is in preparing for system outages.\nIn this talk, Rachel will discuss Jet.com's chaos testing methods and code in depth, as well as lay out a path to implementation that everyone can use.", "confName": "QCon, London 2016", "title": "Microservices Chaos Testing at Jet"}, {"url": "https://qconlondon.com/london-2016/presentation/business-mapping-building-agile-organisation.html", "abstract": "So those expensive consultants helped you roll out an agile method like Scrum or DSDM across a number of teams, and if weâ\u0080\u0099re honest the results have been mixed at best. Some people â\u0080\u009cget itâ\u0080\u009d, some are just doing what they always did but dressing it up in the new terms, others are actively disengaged. The business stakeholders are getting fed up hearing teams tell them â\u0080\u009cWeâ\u0080\u0099re agile so we donâ\u0080\u0099t do datesâ\u0080\u009d or â\u0080\u009cYouâ\u0080\u0099ll get it when itâ\u0080\u0099s readyâ\u0080\u009d, and your senior management are on your back about governance and assurance. This doesnâ\u0080\u0099t sound like the dream they sold you!\nThe problem is that an agile organisation needs to think and act differently, and that agile methods are only part of the story. Each organisation is different and any change on this scale is going to have to adapt to emerging conditions. How can your organisation get the predictability it wants for planning and budgeting, and still benefit from the rich feedback of iterative agile delivery? And how can your staff develop and build a career in a flat organisation?\nTony Grout and Chris Matts think the answer might lie in the emerging areas of Business Mapping and Skills Liquidity. Combining your business strategy with the abilities and aspirations of your people can create a rich landscape of options for achieving genuine business agility, and lead to rich collaboration between business and technical stakeholders. And yes, we do do dates!", "confName": "QCon, London 2016", "title": "Business Mapping: Building an Agile Organisation"}, {"url": "https://qconlondon.com/london-2016/presentation/multi-host-multi-network-persistent-containers.html", "abstract": "Containers are great ephemeral vessels for your applications. But what about the data that drives your business? It must survive Containers coming and going, maintain its availability and reliability, and grow when you need it.\nIn this talk, we will review a number of strategies to deal with persistent Containers; we will also discuss where the data can be stored and how to scale the persistent Container layer. We will include code samples and interactive demos showing the power of Docker Machine, Engine, Swarm and Compose, then combine them with multi-host networking to build a reliable, scalable and production-ready tier for the data needs of your organization.", "confName": "QCon, London 2016", "title": "Multi-Host, Multi-Network Persistent Containers"}, {"url": "https://qconlondon.com/london-2016/presentation/creating-customer-centric-products-using-big-data.html", "abstract": "This presentation includes solutions to some of the toughest big data challenges in financial services using scalable, open-source technology. The speaker will share case studies and examples in the areas of:\n\nUser experience centric predictive analytics and marketing\nPersonalisation of applications and targeted offers\nSocial data analytics and sentiment analysis\nCybersecurity and fraud detection\nOpen stack and open data collaboration\nAttracting data science talent via OSS opportunities", "confName": "QCon, London 2016", "title": "Creating Customer-Centric Products using Big-Data"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/designing-microservices-architecture-nodejs.html", "abstract": "Thomas Cook recently architected much of their back-end. They chose a NodeJS micro-service architecture and in this talk Pascal Laenen, the Head of Architecture for their Omni-Channel team, will act as a guide through the journey they took from initial idea to execution of building their micro-service architecture. He'll cover the good, the bad, the ugly and the beautiful.", "confName": "QCon, London 2016", "title": "Designing a microservices architecture with NodeJS"}, {"url": "https://qconlondon.com/london-2016/presentation/how-do-we-audit-algorithms.html", "abstract": "Algorithms are increasingly being used to automate what used to be human processes. They are potentially more fair and objective, but they are not automatically so. In fact they can easily codify unfair historical practices. I will discuss some examples of this problem and then I'll pose the question, how would we transparently and comprehensibly audit such algorithms for fairness?", "confName": "QCon, London 2016", "title": "How do we Audit Algorithms?"}, {"url": "https://qconlondon.com/london-2016/presentation/microservice-antipatterns.html", "abstract": "Everyone's talking about microservices, but few have used them in anger. They haven't given any real thought to best practices around building and deploying them. In this talk, we'll highlight many of the mistakes we've seen people make when building a microservices architecture. We'll discuss:\n\nWhen microservices are appropriate, and where to draw the lines between services.\nDealing with performance issues (data affinity, parallelism, monitoring).\nTesting and debugging techniques.\nManaging a polyglot landscape and the explosion of platforms.\nManaging failure and graceful degradation.", "confName": "QCon, London 2016", "title": "Microservice AntiPatterns"}, {"url": "https://qconlondon.com/london-2016/presentation/culture-eats-principles-breakfast.html", "abstract": "Agile at scale means different things to different people depending on their context.\nWe want to share our personal experiences of very large scale Agile transformation, what we have done and how weâ\u0080\u0099ve done it, not only in IT but beyond IT. Very large in our context is over 130,000 employees in 50 countries with four main businesses in Financial Services and a history of more than 300 years.\nWe will look at the challenge of using Agile to bring about culture change from different perspectives, comparing and contrasting what needs to be done at an organisational level to make change happen and how that change can be perceived at a team level.\nWe will share both what has gone well and what we would do differently. We hope to inspire you with our ideas on how to get started and which next steps to take in order to advance your organisations towards greater agility.", "confName": "QCon, London 2016", "title": "Culture Eats Principles for Breakfast"}, {"url": "https://qconlondon.com/london-2016/presentation/continuous-integration-openshift-and-jenkins.html", "abstract": "Openshift provides a mechanism for building and deploying applications. Jenkins is a tool used for continuous integration, delivery and deployment. If we combine these together we can create a CI/CD pipeline that will allow us to promote builds of applications and make them available in our OpenShift instance. This could also be extended to publish to an external Docker registry as well. In this presentation, I will walk you thought the process of deploying Jenkins in OpenShift, leveraging the Kubernetes plugin and configuring the delivery pipeline from test to production.", "confName": "QCon, London 2016", "title": "Continuous integration with OpenShift and Jenkins"}, {}, {"url": "https://qconlondon.com/london-2016/presentation/case-bringing-swift-server.html", "abstract": "The Swift language continues to grow and is now one of the most popular mobile programming languages. Since the introduction of open source Swift for Linux, IBM has been enabling the language on the IBM Cloud.\nDuring this session, we will present a preview of our latest cloud deployment configurations, Swift package-based cloud services, and tools integration. In addition, the IBM Swift Sandbox continues to be the place to get a taste of Swift running on the cloud. Come join this session to hear more about what is next for Swift @ IBM.", "confName": "QCon, London 2016", "title": "The Case for bringing Swift to the Server"}, {"url": "https://qconlondon.com/london-2016/presentation/rxjs-5-depth.html", "abstract": "RxJS introduces a new Data Architecture based on Reactive Programming. RxJS 5 is a rewrite of Reactive Extensions focused on performance and usability.We will explore Observables API using RxJS koans and Unit Tests.", "confName": "QCon, London 2016", "title": "RxJS 5 In-depth"}, {"url": "https://qconlondon.com/london-2016/presentation/natural-language-processing-nlp-here-be-dragons.html", "abstract": "Natural Language Processing (NLP) is an essential part of a growing number of products, covering a vast scope of issues from the seemingly mundane (entity recognition) to the seriously involved (automatic summarization). In all cases, the goal is to reproduce or approximate a process - language - that we as humans rarely think twice about: this makes NLP a field fraught with misunderstandings and incorrect assumptions.\nWe will talk about the common pitfalls of treating language like 'just another data-setâ\u0080\u0099 and offer some insight into best practices.", "confName": "QCon, London 2016", "title": "Natural Language Processing (NLP): Here be dragons"}, {"url": "https://qconlondon.com/london-2016/presentation/ddd-and-microservices-last-some-boundaries.html", "abstract": "Microservices are associated with extreme isolation (e.g. no shared database, autonomous dev-ops teams, etc.) At its best, this creates a practical boundary within which modeling and design have a chance to thrive. In Domain-driven Design (DDD) we call this a â\u0080\u009cBounded Contextâ\u0080\u009d.\nBounded contexts take many forms, some leakier than others, and the current best practices of microservices have given us perhaps the strongest mainstream manifestation of this principle to date. In this way, microservices can help teams who attempting DDD or other sophisticated approaches.\nYet, as services get small and numerous, we might substitute one problem for another: The tangle of the monolith just migrates to become a tangle of interactions between microservices. Here, the strategic design principles of DDD can give architects a conceptual framework for working with suites of services and higher-level relationships between larger parts of systems.\nThis talk will introduce a few strategic design concepts and explain how they apply to development of microservices, as a tool for teams trying to grow large systems more coherently.", "confName": "QCon, London 2016", "title": "DDD and Microservices: At last, some boundaries!"}, {"url": "https://qconlondon.com/london-2016/presentation/techniques-successful-agile-transformation.html", "abstract": "Agile means different things to different people. Some people say theyâ\u0080\u0099re agile, but thatâ\u0080\u0099s usually very different to another group of people who also claim theyâ\u0080\u0099re agile.\nIn this talk, weâ\u0080\u0099ll share with you how we recommend getting your Agile transformation to a great start and sustain it in the long term. Youâ\u0080\u0099ll learn about the dangers of taking shortcuts when the going gets tough and the level of discipline required to get the most out of adopting Agile. Weâ\u0080\u0099ll cover the good, the bad and the ugly from our experience at SagePay as well as the results we achieved and how we plan to evolve our Agile implementation in the future.", "confName": "QCon, London 2016", "title": "Techniques for a Successful Agile  Transformation"}]