[{"url": "https://qconlondon.com/london-2017/london-2017/presentation/building-and-trusting-cloud-bank.html", "abstract": "\"Fail fast and fail often\" - not only does the Silicon Valley mantra speak volumes on the relentless pursuit of innovation, it also highlights technology's power of unpredictability. But when creating a bank from scratch, the art is in combining pace of change and stability.\nSo when your boss thinks you are the next Google, the regulators say \"what the cloud\" and customers only care about being there 24/7 - what do you do? With a year to do it, you won't get the resilience you need by coding AI-style self-healing capabilities into your infrastructure. Instead, you aim for simple, safe and scalable.\nWe will discuss how Starling Bank, part of the new movement in FinTech challenger banks, is innovating whilst addressing the need for resilience in a world where failure is everywhere.\nWe are a fast-paced tech company, built around an integral team of engineers aiming at a completely new way for people to see their money. But people have strong and specific expectations when you are handling their cash. We will explain how we use techniques like failure injection and rapid, continuous delivery to build a cloud bank that customers can trust with their money and the regulator can trust with their guarantee.", "confName": "QCon, London 2017", "title": "Building and Trusting a Cloud Bank"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/tech-debt-presentation.html", "abstract": "In most systems, code lives forever. Occasionally, we can delete it if we are sure it is not used; however, static path analysis and production monitoring of code usage are often expensive and present inconclusive results. In this talk, Michael Feathers will describe techniques that allow us to generate more certainty around our assessments of feature liveness, and strategies that can be used to remove code that does not have high value.", "confName": "QCon, London 2017", "title": "Strategic Code Deletion"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/microservices-at-the-heart-of-bbc-iplayer.html", "abstract": "The BBC iPlayer API used to be a monolithic Java application. Two years ago we switched to Node.js microservices and we have been iterating on it ever since. We have learnt many things along the way including how to keep distributed systems decoupled, how to monitor the health of our services in real-time and how to move faster as a team. We'll share our journey without sugar-coating the mistakes we've made along the way.", "confName": "QCon, London 2017", "title": "Microservices At The Heart of BBC iPlayer"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/effective-data-pipelines-data-mngmt-chaos.html", "abstract": "Creating automated, efficient and accurate data pipelines out of the (often) noisy, disparate and busy data flows used by today's enterprises is a difficult task. Data science teams and engineering teams may be asked to work together to create a management platform (or install one) that helps funnel these streams into the company's so-called data lake. But how are these pipelines managed? Who is in charge of maintaining services and reducing costs? How do we ensure data is not lost, not duplicated and is factually accurate? These concerns, among others, will be discussed alongside implementation decisions for those looking for a practical recommendation on the what and how of data automation workflows.", "confName": "QCon, London 2017", "title": "Effective Data Pipelines: Data Mngmt from Chaos"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/tips-creating-more-equal-workplace.html", "abstract": "Institutional bias is death by a thousand papercuts. Unequal work environments today are comprised of a lot of small inequalities that add up to the gender pay gap, the racial hiring gap, and environments that can be unintentionally antagonistic towards non-traditional groups. This talk covers what is institutional bias, why itâ\u0080\u0099s a problem, and how it manifests in the workplace. Finally, weâ\u0080\u0099ll go over a process to help you actually start addressing those paper cuts one at a time. While I donâ\u0080\u0099t have all the answers, I will give you a process that will help you start to identify and solve workplace inequalities at your company.", "confName": "QCon, London 2017", "title": "Tips For Creating a More Equal Workplace"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/mastering-app-store-landscape-telemetry.html", "abstract": "There are hundreds of App stores in the world serving millions of customers with millions of apps; these numbers are ever increasing and not just limited to smartphone or tablet App stores, making sense of this data to provide valuable insight on the trends across multiple territories and industry sectors is complicated and requires process of thousands of metrics a second.\nThis presentation will delve in to the challenges appScatter has had in building its platform to support these app stores and how they use Statful to provide insight data into its infrastructure and business metrics", "confName": "QCon, London 2017", "title": "Mastering the app Store landscape with telemetry"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/lessons-immutability-scale-nhs-digital-sus.html", "abstract": "What are your perceptions of NHS IT? Not great? Well the truth is very different to what you might expect. There is something of a technical renaissance going on in parts of the NHS where things are being done in a modern way, learning from past experiences.\nWe'll look at one example system where we've built a highly resilient multi-data centre data processing system utilising techniques more often used in the cloud but with bare metal servers. See how weâ\u0080\u0099ve built automated performance tests, an immutable infrastructure and a NoSQL data store with support for versioning data.", "confName": "QCon, London 2017", "title": "Challenging Perceptions of NHS IT"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/performance-testing-java.html", "abstract": "Writing software is regarded by many developers as a craft or an art. However when it comes to performance tuning and/or testing many believe it to be more of a dark art. Nothing farther from the truth. We can gain a lot by applying a concrete methodology and similar reasoning techniques we follow when writing production code. There are tools in the Java space that can help us get better measurements and results, JMeter perhaps one of the most well known, JMH is probably the next likely candidate. We'll discuss these tools and some techniques that should make engaging in performance testing a rewarding experience.", "confName": "QCon, London 2017", "title": "Performance Testing in Java"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/using-quality-views-to-tackle-tech-debt.html", "abstract": "When you work in engineering or operations, you become intimately familiar with the challenges of technical debt. It can be difficult, however, to communicate the full cost to others in the organization, particularly to people who are non-technical. Communicating the risks for software systems that are not directly customer-facing can be especially difficult. For these systems, it can be easy to ignore the technical debt until it becomes crippling.\nColin Breck has been using quality views to highlight technical debt and ensure the risks associated with it are balanced against the product development objectives of the organization. Quality views represent the system holistically, describing where investments are being made and where they are not being made. They highlight risks and demonstrate how the system is evolving over time. He will share his approach, explore examples, and provide some practical advice and observations based on his experience using quality views.\nQuality views may help you improve communication in support of tackling technical debt in your organization.", "confName": "QCon, London 2017", "title": "Using Quality Views to Tackle Tech Debt @Tesla"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/hitchhikers-guide-serverless-javascript.html", "abstract": "Tools like AWSâ\u0080\u0099s Lambda, Google's Cloud Functions, and many others are allowing us to create â\u0080\u009cserverlessâ\u0080\u009d applications. At Bustle (a top 30 website in the US) we are taking full advantage of this new infrastructure. APIs, databases, searching, indexing, server side rendered javascript, are all being handled without deploying any of our own servers. And the best part? It costs orders of magnitude less than our old VM based deployments. Iâ\u0080\u0099ll walk attendees through our entire serverless stack. I'll talk about the good, the bad, and the ugly. I'll share real numbers from production systems.\nThe goal is that attendees will leave with concrete knowledge of what going serverless really means and be able to decide if it makes sense for their own infrastructure.", "confName": "QCon, London 2017", "title": "The Hitchhiker's Guide to Serverless Javascript"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/data-cleansing-and-understanding-best-practices.html", "abstract": "Any data scientist who works with real data will tell you that the hardest part of any data science task is the data preparation. Everything from cleaning dirty data to understanding where your data is missing and how your data is shaped, the care and feeding of your data is a prime task for the working data scientist.\nI will describe my experiences in the field and present some useful open source software to automate some of the necessary but insufficient things that I do every time I'm presented new data. In particular, we'll talk about discovering missing values, values with skewed distributions and discovering likely errors within your data, as well as a novel approach at finding data interconnectedness based on usage using unsupervised learning.\nI will describe the impact of these lessons to team construction and how to avoid some of the most painful lessons.", "confName": "QCon, London 2017", "title": "Data Cleansing and Understanding Best Practices"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/one-repo-enable-devops-monorepo.html", "abstract": "These days there is a clear trend to store your versioned files in a DVCS, a distributed version control system, which is typically Git. A DVCS is aimed at on one project, for example the sources of one library or one product. The Linux kernel, for which Git was originally designed, is almost the exception for its repository size and scope.\nKeeping repositories separate has many advantages, especially for developers, however there are also challenges. Individual projects such as modules are not always independent but have interdependencies, which need to be managed. For DevOps teams this adds complications which are much easier addressed if all projects were stored in a single repository: a monorepo.\nWhat is needed is a hybrid approach: individual repos to individual developers that are stored in the backend as a single monorepo for the DevOps teams. In this talk we are going to discuss the pros and cons of the different approaches and the requirements for a monorepo.", "confName": "QCon, London 2017", "title": "One repo to enable DevOps #monorepo"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/building-reliability-unreliable-world.html", "abstract": "GameSparks is a globally-distributed Backend-as-a-Service platform that serves tens of billions of API requests per month for hundreds of live games which have tens of millions of active users, hundreds of thousands of whom are concurrently connected at any one time. All of our players connect across the public internet â\u0080\u0093 many from mobile devices â\u0080\u0093 and all of our resources run in public clouds, so failure is all around us! Oh, and our customers can write custom server-side code and persist whatever data they wish in the platform. To ensure that we continue to provide a reliable and predictable service, we have designed the platform to be tolerant of many things; unreliable and slow internet connectivity, cloud resources that can fail without warning or suffer performance degradation, poorly-performing or resource-heavy customer code in a multi-tenant environment.", "confName": "QCon, London 2017", "title": "Building Reliability In An Unreliable World"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/high-performance-managed-languages.html", "abstract": "Common wisdom dictates that native languages are the only means of building high-performance applications. How do managed runtimes such as those available to .NET, Java, and even JavaScript, yes even JavaScript compare? Many applications requiring high-performance are now developed for managed runtimes - such as financial trading, data stores and analytics, messaging processing, and even supercomputing.\nOver the last few decades we have seen significant advances in managed runtimes, particularly for JIT compilers and garbage collectors. In this talk we will explore how our managed runtimes can equal, and even better in some cases, the performance of native languages.", "confName": "QCon, London 2017", "title": "High Performance Managed Languages"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/refactoring-mount-doom-tackling-legacy-code.html", "abstract": "Weâ\u0080\u0099ve all had that nightmare where you are try to get to your destination, and keeping moving, trying different things, but for various reasons, you never arrive.\nSome refactorings are like that - you extract methods, name constants, increase readabilityâ\u0080¦ In short, you spend a lot of time cleaning up - but you never get to a good place with the code. In this talk, I will show you how to refactor for the right reasons and the right methods to use your time efficiently. Letâ\u0080\u0099s make working with that code easier in the future.", "confName": "QCon, London 2017", "title": "Refactoring Mount Doom - Tackling Legacy Code"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/adventures-in-javascript-and-the-iot.html", "abstract": "From installations to promote superstar DJs on trains speeding across Europe to sitting in Motorway LED billboards debugging wi-fi cards when the temperature drops below zero, our experience building for the IoT has highlighted just how unpredictable failure can be. This talk is a warts and all look into our work with some of the world's best known brands using JavaScript to power remote installations and interactive applications.\nWe'll cover the technology used (serverless platforms, node.js microservices and JavaScript), how we built the solutions and how we coped with some of the most random failure circumstance you probably couldn't imagine!", "confName": "QCon, London 2017", "title": "Adventures in JavaScript and the IoT"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/enabling-innovation-uber-speed.html", "abstract": "Uber has been growing at a breakneck speed both in terms of business as well as in terms of people. Innovation and the speed of innovation is paramount to our success. At the same time, Uberâ\u0080\u0099s mission is defined as â\u0080\u009cTransportation That Is As Reliable as Running Waterâ\u0080\u009d. How does Uber create an engineering environment that fosters innovation, rapid growth, fast pace and reliability? What does a day in a life of an Uber engineer/data scientist look like? This talk will walk you through the lessons we learnt and the models we created to help us as an engineering organization.", "confName": "QCon, London 2017", "title": "Enabling Innovation at Uber Speed"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/continuously-delivering-security-cloud.html", "abstract": "What does it really mean to keep systems secure on the cloud? When software workloads are distributed across elastic clusters, scaling automatically, and changing rapidly the notions of what it means to be secure shift. In this talk Iâ\u0080\u0099ll show concrete patterns for continuously delivering security based on Justin Smithâ\u0080\u0099s excellent \"\"Rotate, Repave, and Repair\"\":https://medium.com/built-to-adapt/the-three-r-s-of-enterprise-security-rotate-repave-and-repair-f64f6d6ba29d pattern.\nIâ\u0080\u0099ll dive into using common open source tools and up-to-date organizational and cultural practices while exploring the philosophy of this modern approach to security.\nYouâ\u0080\u0099ll leave this talk understanding the importance of automation, secrets management, immutable infrastructure, and continuous delivery all from a security perspective. More importantly, youâ\u0080\u0099ll gain a deeper understanding of practical use cases for tools designed specifically to address these concerns.\nYour CISO has never been this happy.", "confName": "QCon, London 2017", "title": "Continuously Delivering Security in the Cloud"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/microdisservices-microsystems.html", "abstract": "Everyone is talking about microservices, and there is more confusion than ever about what the promise of microservices really means and how to deliver on it. To address this we will explore microservices from first principles, distilling their essence and putting them in their true context: distributed systems.\nWhat many people forget is that microservices are distributed and collaborative by nature and only make sense as systemsâ\u0080\u0094one collaborator is no collaborator. It is in between the microservices that the most interesting and rewarding, and also challenging, problems ariseâ\u0080\u0094enter the world of distributed systems.\nDistributed systems are by definition complex, and we system developers have been spoiled by centralized servers for too long to easily understand what this really means. Slicing an existing system into various REST services and wiring them back together again with synchronous protocols and traditional enterprise toolsâ\u0080\u0094designed for monolithic architecturesâ\u0080\u0094will set us up for failure.\nAs if that wasnâ\u0080\u0099t enough, we canâ\u0080\u0099t just think about systems of microservices. In order to make each microservice resilient and elastic in and of itself, we have to design each individual microservice as a distributed systemâ\u0080\u0094a Â«microsystemÂ»â\u0080\u0094architected from the ground up using the reactive principles.", "confName": "QCon, London 2017", "title": "From Microliths To Microsystems"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/continuous-performance-testing.html", "abstract": "In our world of continuous delivery with repeatable builds and automated deployments, performance testing is often bolted on as an afterthought.\nThis can be an acceptable strategy until your application becomes popular, after which customers can start complaining about application response. As technologists, it is our responsibility to be able to reason about and improve the responsiveness of our systems.\nGood performance testing is not only about catching regressions; it is a key enabler of measurement, investigation & optimisation. With integrated profiling and measurement we can determine how to drive efficient use of compute, network, and memory resources.\nIn this talk we will cover techniques for making performance testing a first-class citizen in your Continuous Delivery pipeline. Along the way, we will cover a number of war stories experienced by the team building one of the world's most advanced trading exchanges. Finally, we will explore how this approach fits in to the landscape of containerisation, virtual machines, and provider-managed resources.", "confName": "QCon, London 2017", "title": "Continuous Performance Testing"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/full-scale-elm-production.html", "abstract": "Elm is a functional programming language that compiles to performant JavaScript. At NoRedInk we have over 80,000 lines of production Elm code. It's the primary technology we use to build our Web application's user interface, which students around the world use to answer millions of questions per day. Since we began using Elm in 2015, our production Elm code has yet to cause a single runtime exception. Our error logs show plenty of crashes from our legacy JavaScript code, but none from our Elm code. We've also found our Elm-powered front-end substantially easier to scale than our previous React code base. In this talk, attendees will gain an understanding of how the Elm programming language works, what differentiates it from the other front-end technologies on the market, and practical advice for introducing it to an existing JavaScript code base. The talk will contextualize all this in an experience report of shipping production Elm code, including how it has impacted our team's velocity, technical debt, and hiring. Attendees are assumed to be comfortable with JavaScript, but no other knowledge is needed. Come see how nice your team's front-end programming experience can become!", "confName": "QCon, London 2017", "title": "Full-Scale Elm in Production"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/reliable-scalable-data-eco-system-at-uber.html", "abstract": "Uber's vision is to make transportation as reliable as running water everywhere, for everyone. Data is key for Uber's 24x7 global business operations and making data available for different use cases across the company in a reliable, scalable and performant way is often challenging.\nIn this talk, we will discuss the overall data analytics eco-system at Uber and learn on how Uber shapes its data from a raw form to a modeled form by leveraging various in-house and open source technologies such as Hadoop, Hive on Tez/MR, Spark, Presto, Airflow and Enterprise technology such as HPE Vertica. Consumers of this data include Machine Learning & data science, city operations, Experimentation, Fraud, Marketplace and Growth Analytics.\nWe will also discuss on a whole different aspect of going back to basics on traditional data modeling and how it has helped us scale analytical and adhoc interactive queries while retaining the same standard SQL interface offered by SQL-on-Hadoop technologies like Hive, Presto and Spark. We will also discuss how we built and orchestrate ETL and Data processing pipelines leveraging Piper (forked from Airflow).\nFinally, we will discuss couple of real time use cases of leveraging this framework and how this helped us power key business operations.", "confName": "QCon, London 2017", "title": "Reliable & Scalable Data Infra Eco-System At Uber"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/evolving-engineering-culture-criteo.html", "abstract": "Criteo, a leader in the fiercely competitive Adtech sector, started in France and now has several hundred engineers distributed across four locations. Thanks to our strong engineering culture fostered by our founders, R&D driven innovation is at the heart of Criteoâ\u0080\u0099s growth. Criteoâ\u0080\u0099s engineering leaders went one step further and created a framework to continually evolve the culture to meet the needs of our growing team. We'll share our definition of engineering culture, describe its key elements, and elaborate on how it evolved over time.", "confName": "QCon, London 2017", "title": "Evolving the Engineering Culture @Criteo"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/lessons-learned-building-hyper-scale-cloud-service.html", "abstract": "Oracle is getting serious about the cloud and is building out new cloud services at a rapid pace. In order to build those hyper-scale, resource efficient multi-tenant services, they have chosen Docker containers and tool such as Kubernetes to optimize resource consumption and devops processes. Developing such services is just half the story; the other half is how to apply devops best practices, in order to run those services in an always on, hyper-scale and resilient way. Attend this session to hear the lessons learned by Oracle engineers from building these hyper-scale managed cloud services. They will discuss pros and cons of the architecture chosen, and will cover development as well as devops best practices, which allow them to offer those services to their customers. Come find out about the new forces at work within Oracle today.", "confName": "QCon, London 2017", "title": "Lessons Learned Building Hyper-Scale Cloud Service"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/latency-sensitive-microservices.html", "abstract": "In this talk we will look at the differences between micro-services and monolith architectures and their relative benefits and disadvantage. We will look at design patterns which will allow us to utilize these different strategies as a deployment concern without significant changes to the business logic. We will look at how micro-service architecture can be implemented under low latency constraints of 10 - 100 micro-second latencies, in Java in particular, and how these strategies reduce the impact of serializing data and logging.", "confName": "QCon, London 2017", "title": "Latency Sensitive Microservices"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/async-or-bust.html", "abstract": "Asynchronous is the new normal! Or is it? Many of our languages, runtimes, and libraries are built around synchronous behaviour and usage as we keep trying to make RPC work by force of will. Primitives such as futures and promises present a synchronous facade. Blocking I/O dominates the vast majority of designs. Most of our communication models and architectures depend on synchronous methods of communication. For many years, we've been told that synchronous is simpler and performs just as well as more complex asynchronous designs. Is that true? Or is all that a myth and asynchronous design truly is the means to unshackle our designs for better performance? Maybe synchronous designs are a leaky, or just plain wrong, abstraction that limits our systems? This session will try to shed some light on these questions and perhaps raise some new ones around this seemingly eternal debate.", "confName": "QCon, London 2017", "title": "Async    Or    Bust!?"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/crystal-ball-prioritize-technical-debt.html", "abstract": "The technical debt metaphor has taken the software world with storm. No wonder, since software projects have their fair share of challenges. Most organizations find it hard to prioritize and repay their technical debt. The main reason is the scale of modern systems with million lines of code and multiple development teams; no one has a holistic overview. So what if we could mine the collective intelligence of all contributing programmers and start to make decisions based on data from how the organization actually works with the code?\nAdam Tornhill introduces one such approach with the potential to change how we view software systems, offering an overview of techniques, based on software evolution and findings from various fields within psychology, that help uncover both problematic code and the social dimension of the teams that build your software. This combination lets you prioritize the parts of your system that benefit the most from improvements, detect organizational issues, and make practical decisions guided by data. Adam illustrates each point with a case study from a real-world codebase.\nThis new perspective on software development will change how you work with legacy systems.", "confName": "QCon, London 2017", "title": "A Crystal Ball To Prioritize Technical Debt"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/building-a-data-science-capability-from-scratch.html", "abstract": "This talk will cover the challenges, both technical and cultural, of building a data science team and capability in a large, global company. It will discuss best practices, lessons learned, and rewards of leveraging data effectively in the next frontier of data science: commercial insurance.", "confName": "QCon, London 2017", "title": "Building a Data Science Capability From Scratch"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/holistic-detective-hunt-great-tech-culture.html", "abstract": "Seeing the whole and thinking wider than software and development processes is something we find very hard to do in the tech industry. Itâ\u0080\u0099s so easy to get distracted by the amazing new languages, the neat gadgets, or the fun of tricks like mob programming. If we start to apply a wider lens, some systems thinking, queuing theory, psychology and a sprinkle of cynefin we soon see that if we want to drive an organisation of great teams made of great people that create great products, itâ\u0080\u0099s going to be hard! We need to pull some really big levers like culture, leadership, and HR processes. These all bring crazy complexity and we need to worry about them at individual, team, and the organisation level, even with the customer! This requires a big holistic picture, a holistic detective team and a commitment from senior leadership to change the big things.\nI will cover key elements of the organisational complexity puzzle, why itâ\u0080\u0099s so important, what patterns could you choose to use, how we coordinate to achieve change, what changes we have driven in Ocado Technology following this idea and how can we measure the success of this.", "confName": "QCon, London 2017", "title": "The Holistic Detective Hunt For Great Tech Culture"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/devopsscale.html", "abstract": "Remember the times when one server was enough? And a guy named â\u0080\u009csysadminâ\u0080\u009d was babysitting it along with his other duties of installing MS Office for everybody?\nFor better or for worse, those times are long gone. Today, companies manage tens of thousands of servers and perform thousands of production changes per day.\nIn this talk we will look at the resources, techniques and tools needed for managing DevOps at Scale and we will discuss the challenges that companies encounter when they hit it.", "confName": "QCon, London 2017", "title": "Dev   Ops   @  Scale"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/in-memory-caching-curb-tail-latency-with-pelikan.html", "abstract": "In-memory caching in a distributed setting is widely used these days, and users usually expect it to be \"fast and cheap\". One important but often overlooked aspect of cache is tail latencyâ\u0080\u0093 for many real-time applications, tail latency plays an outsized role in determining the overall performance and reliability.\nControlling tail latency, however, is tricky business, and much harder to achieve than good average latency. It requires understanding the details and subtleties in low-level system behavior, including memory management, threading model, locking, network I/O, etc.\nPelikan is a framework to implement distributed caches such as Memcached and Redis. This talk discusses the system aspects that are important to the performance, especially tail latency, of such services. It also covers the decisions we made in Pelikan, and how they help us reason about performance even before we run benchmarks.", "confName": "QCon, London 2017", "title": "In-Memory Caching: Curb Tail Latency with Pelikan"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/design-for-future-while-crushing-debt-coinbase.html", "abstract": "In the past 4 years Coinbase has grown from one service in production to over 100. Our team has grown 50x, weâ\u0080\u0099ve launched in 30 countries and reinvented ourselves several times as we mature and our industry evolves. We believe a failure mode of financial companies is the death of innovation once encumbered by tech debt and the fear to change that follows. While maintaining an uncompromising level of increasingly scrutinized security, weâ\u0080\u0099ve systematically attacked tech debt to stay agile and step ahead of our competitors. This talk will take a deep dive into how Coinbase attacks tech debt, including deployments, testing, immutable + codified infrastructure. Weâ\u0080\u0099ll share a recent \"Scorched Earth\" event where we upgraded and rebuilt 100% of our infrastructure from scratch in 24 hours. Tech includes AWS, Docker, CoreOS, Terraform, GeoEngineer and more.", "confName": "QCon, London 2017", "title": "Crushing Tech Debt Through Automation at Coinbase"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/rebuilding-the-monolith-with-composable-apps.html", "abstract": "Working with JavaScript is exciting. There's constant change - in the language, the runtimes and the community. The last 24 months have seen the rise and fall of frameworks, libraries, platforms and best practises. All this change is great if you have the option to build smaller products, either starting from scratch or being given a green light to completely re-write an application in one go. But what if you can't do that? What if you have a valuable, scaled, complex product? How do you get to introduce these new ideas, best practices and frameworks? How do you effectively refactor your customer facing software to be the application you want it to be?\nAs the proud owners of a monolithic PHP and JavaScript codebase (with a side helping of Sass and Java), we were asking ourselves the same question. How do we remove our reliance on server-side templates, a monolithic codebase, shared pipelines and coupled services by replacing them with a fast, resiliant, clean and functional front-end backed by smaller, focused apis?\nWe came up with a plan and started the road to refactoring - this is our story of going beyond the monolith.", "confName": "QCon, London 2017", "title": "Rebuilding The Monolith With Composable Apps"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/building-data-pipelines-in-python.html", "abstract": "This talk discusses the process of building data pipelines, e.g. extraction, cleaning, integration, pre-processing of data, in general all the steps that are necessary to prepare your data for your data-driven product. In particular, the focus is on data plumbing and on the practice of going from prototype to production.\nStarting from some common anti-patterns, we'll highlight the need for a workflow manager for any non-trivial project.\nWe'll discuss the case for Luigi as an interesting option to consider, and we'll consider where it fits in the bigger picture of deploying a data product.", "confName": "QCon, London 2017", "title": "Building Data Pipelines in Python"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/delivering-value-while-behind-enemy-lines.html", "abstract": "Delivering software can sometimes feel like a battle against the organisation around you, rather than an exercise in working with it. Looking at how  runs can be helpful, but it can also simply make you jealous. Not all of us get to work for one of those companies, nor be empowered to make the changes required at our own companies. Adaptive is a software consultancy focused on financial services and capital markets, and we deliver projects, large and small, into some of the most hostile engineering cultures known in software development. In this talk I'll discuss how we manage to get things done in the face of huge cultural resistance while maintaining our own engineering culture and leaving our clientsâ\u0080\u0099 development teams in a better place than when we arrived.", "confName": "QCon, London 2017", "title": "Delivering Value While Behind Enemy Lines"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/session-about-cognitive-services-microsoft.html", "abstract": "Microsoft Cognitive Services let you build apps with powerful algorithms using just a few lines of code. They work across devices and platforms such as iOS, Android, and Windows, keep improving, and are easy to set up. Join us to learn about those APIs (including Bing search APIs) and see how you could embed them into your software solutions.", "confName": "QCon, London 2017", "title": "Empowering Apps with Microsoft Cognitive Services"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/evolution-spotifys-ads-architecture.html", "abstract": "In a hyper growth product company continuous evolution of systems is inevitable as technology improves everyday, product and business needs evolve regularly and change in scale impacts operating costs. At Spotify the ads systems have undergone several changes fundamentally over the years. The performance needs from Spotify's ad technology stack are very demanding - high volume, high availability and low latency. Any downtime or outage has a direct and real revenue impact. Overtime as newer consumer platforms have emerged, backend and data infrastructure technologies have matured and Spotify products have evolved; the needs of the ad technology systems have changed as well. This has resulted in continuous evolution of individual components and the overall architecture. In this talk the speaker will share his experiences about lessons learnt while evolving Spotify's Ad systems without disrupting daily activity.", "confName": "QCon, London 2017", "title": "Architectural Overhaul: Ad Serving @Spotify Scale"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/predictability-ml-applications.html", "abstract": "In the context of building predictive models, predictability is usually considered a blessing. After all â\u0080\u0093 that is the goal: build the model that has the highest predictive performance. The rise of â\u0080\u0098big dataâ\u0080\u0099 has in fact vastly improved our ability to predict human behavior thanks to the introduction of much more informative features. However, in practice things are more differentiated than that. For many applications, the relevant outcome is observed for possibly very different reasons. In such mixed scenarios, the model will automatically gravitate to the one, that is easiest to predict at the expense of the others. This even holds if the predictable scenario is by far less common or relevant. We present a number of such scenarios: clicks on ads being performed â\u0080\u0098intentionallyâ\u0080\u0099 vs. â\u0080\u0098accidentallyâ\u0080\u0099, online forms being filled out by people or fraudulent bots, and finally consumers visiting store locations vs. their phones pretending to be there. The combination of different and highly informative features can have significantly negative overall impact on the usefulness of predictive modeling.", "confName": "QCon, London 2017", "title": "Predictability In ML Applications"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/deep-learning-frameworks.html", "abstract": "In this talk Micha will show how to build a working product with Keras, a high level deep learning framework. He'll start by explaining deep learning at a conceptual level, before describing the product requirements. He'll then show code and discuss design decisions that demonstrate how to train and deploy the model. In the process, he'll place Keras in context in the deep learning framework ecosystem, that includes Tensorflow, MXNet and Theano.", "confName": "QCon, London 2017", "title": "Products And Prototypes With Keras"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/deliver-docker-containers-continuously-aws.html", "abstract": "With Docker it became easy to start applications locally without installing any dependencies. Even running a local cluster is not a big thing anymore.\nAWS on the other side offers with ECS a managed container service that starts to schedule containers based on resource needs, isolation policies, and availability requirements.\nSounds good, but is it really that easy? In this talk, you'll get an overview of ECS and all other services that are needed to run your containers in production. Philipp shows how an ECS cluster and your containerized applications can automatically be deployed and scaled. He also shares his experiences and discusses what features are still missing.", "confName": "QCon, London 2017", "title": "Deliver Docker Containers Continuously on AWS"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/coding-for-high-frequency-trading.html", "abstract": "Financial Services run arguably the most complex applications, with major institutions each running thousands of different applications. The most challenging and performance critical are the High Frequency Trading systems used in the Equities markets. This session will describe the application environments, design patterns and programming languages commonly deployed across Financial Services including Investment Banks and Hedge Funds.", "confName": "QCon, London 2017", "title": "Coding for High Frequency Trading"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/lending-privilege.html", "abstract": "Diversity and inclusion have become hot topics in technology, but you may not know how you can make a difference. This talk will help you understand that, no matter your background, you have privilege and can lend it to marginalized groups in tech.", "confName": "QCon, London 2017", "title": "Lending     Privilege"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/web-components-scale.html", "abstract": "Huge applications consume a lot of time to develop and prepare for the development environment. After a while technology changes, new frameworks arrives, and application requirements changes. Going back to the development phase can be painful. During this presentation, we'll be discussing web standards and how to use them in favour of the development process as well as how to use web components to write a scalable application and how these can help minimise cost of changes. We'll touch on the Polymer framework and what the future brings, moving from Polymer 1.0 to Polymer 2.0.", "confName": "QCon, London 2017", "title": "Web Components @ Scale"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/scaling-facebook-live-videos-billion-users.html", "abstract": "Facebook Live is a live streaming platform available to all Facebook users (1 billion daily active people) from Facebook apps as well as an API. It enables citizen journalism, makes it easy to share everyday moments with your friends and allows celebrities to interact with their fans directly. Facebook Live has seen a tremendous growth in usage since being launched to the public.\nBuilding a successful Live streaming platform requires live streams to have low latency and high quality. Broadcasting and viewing live streams has to work on a wide variety of devices across varying network capabilities. Interactivity during live streams is a key part of the overall experience. In this talk, we will talk about why Live matters, how Facebook Live was architected for these requirements and how it is setup to be flexible in adding features like multi-person live streaming.", "confName": "QCon, London 2017", "title": "Scaling Facebook Live Videos to a Billion Users"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/achieving-high-load-advertising-technology.html", "abstract": "High Load consists of three factors:\n\nLatency - The Speed of an individual request, business transaction or event\nThroughput - The Scale required to process a number business transactions per time period a.k.a TPS\nAvailability - The system 99.XXX% availability 24/7/365 AdTech is the technology that supports Digital Marketing.\n\nThe â\u0080\u009cfreeâ\u0080\u009d internet services such as, Email, Facebook, Skype, etc. are funded by Digital marketing. In this talk you will learn the technologies used and how they are implemented to see the High Load demanded by Digital marketing. You will also hear some of the War stories and how problems were solved.", "confName": "QCon, London 2017", "title": "Achieving High Load in Advertising Technology"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/learning-systems-open-space.html", "abstract": "In this interactive workshop, Micha Gorelick will lead you through modification an existing deep learning product implemented in Keras. If you plan to run the code, please come with a well-charged laptop battery! And if you get the chance, please also download the python packages and data we'll be working with using the following three commands:\n\no https://github.com/mynameisfiber/2017-qcon-deeplearning", "confName": "QCon, London 2017", "title": "Mini Workshop: Hands-on Deep Learning"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/continuous-delivery-the-hard-way-with-kubernetes.html", "abstract": "Devops best practice says you should version control the configuration of your deployment. But you want to automate the delivery of new versions of your software through a CI/CD pipeline. In this talk we'll assemble a CI/CD pipeline from scratch to Kubernetes using GitLab CE as an example. Finally we'll look at open source tools which can facilitate coordinating simultaneously updating configuration and performing releases to Kubernetes, as well as rolling back and pinning releases, and also having different release policies to different environments. The talk will be mostly demos.", "confName": "QCon, London 2017", "title": "Continuous Delivery The Hard Way With Kubernetes"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/environment-infrastructure-testing-using-ruby.html", "abstract": "With the rise of DevOps, programmable infrastructure is reaching widespread adoption. However, although automated testing of software is becoming ever more common, the same cannot be said with testing the target deployment environment itself. With microservices making our deployments more and more complex, we can no longer afford to ignore this type of testing. This talk will take a tour through some approaches to environment infrastructure testing that we have created using Ruby, a language we feel is uniquely positioned to work with both infrastructure and testing.", "confName": "QCon, London 2017", "title": "Testing Programmable Infrastructure with Ruby"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/drowning-data-thirsting-insight.html", "abstract": "Welcome to the digital era where customer experience management grows more dependent on more data from more sources every day, making issues harder to detect, harder to investigate and diagnose, and harder to resolve quickly. We know that data proliferation will only accelerate, so our industry needs to adapt new ways to analyze, respond, and ultimately to break out of the cycle of reacting to issues â\u0080\u0093 to lead prevention and optimization initiatives. We can start with smarter analytics.\nIn this presentation Catchpointâ\u0080\u0099s Mehdi Daoudi will break down the changing dynamics beneath the never-ending flood of performance data and how itâ\u0080\u0099s changing digital experience monitoring today. Understanding the root causes of data proliferation is critical to solving the challenges it brings, and Daoudi sees a way forward to leverage the analytical power of the platforms we use to guide the exploration of issues, slash MTTR, and change the role of IT ops forever.", "confName": "QCon, London 2017", "title": "Drowning in Data, Thirsting for Insight"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/low-latency-trading-architecture-lmax-exchange.html", "abstract": "Building a financial exchange like the one that LMAX Exchange operates presents a unique challenge. Our customers trade over $2 trillion a year through our platform, while demanding low and predictable latency with ever increasing volumes of transactions. In this talk we will present an overview of the architecture we use to deliver this, and share our experience of how taking a scientific approach to testing and tuning software has helped us to build a high-availability stateful system that regularly processes many tens of thousands of transactions per second in a single thread, with round-trip latencies through our systems measuring just 80 microseconds - all the while running on commodity Intel servers and written in plain old Java.", "confName": "QCon, London 2017", "title": "Low Latency Trading Architecture at LMAX Exchange"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/extreme-programming-meets-realtime-data.html", "abstract": "At Unruly, we're fast and furious both in terms of the volumes we're handling and in our development process. Scaling incrementally has raised some interesting challenges in how to deal with growing data volumes, and by trying to deliver value in small steps, we've ended up with some unconventional solutions. We'll talk about scaling problems we've encountered, and where extreme programming values led us.", "confName": "QCon, London 2017", "title": "Extreme Programming Meets Realtime Data"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/ml-software-engineering-best-practices.html", "abstract": "Machine learning is powering huge advances in products that we know and love. As a result, ever growing parts of the systems we build are changing from the deterministic to the probabilistic. The accuracy of machine learning applications can quickly deteriorate in the wild without strategies for testing models, instrumenting their behaviour and the ability to introspect and debug incorrect predictions. Wouldn't it be nice to have the best of the software engineering and machine learning worlds when building our systems? This session will take an applied view from my experience at Ravelin, and will provide useful practices and tips to help ensure your machine learning systems are robust, well audited, avoid embarrassing predictions, and introspectable, so you can hopefully sleep a little better at night.", "confName": "QCon, London 2017", "title": "Building Robust Machine Learning Systems"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/when-containers-attack.html", "abstract": "A deep dive into history: what can the past tell us about full stack engineers, popular tech platforms and the dangers of searching for the perfect technology.", "confName": "QCon, London 2017", "title": "When Containers Attack!"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/shaving-my-head-made-me-better-programmer.html", "abstract": "How do perceptions and stereotypes affect those in the programming community? This talk tells the true story of my physical transformation, and the surprising and drastic ways in which it affected how I was perceived and treated as a programmer. This new perspective allowed me to take a hard look at our community, and how it can at times be less welcoming and inclusive than we all intend it to be. This talk also covers the effects of unconscious bias, micro-aggressions, and stereotype threat within our community, and how to make engineering teams and our entire field more inclusive to all, and thusly more successful.", "confName": "QCon, London 2017", "title": "Shaving My Head Made Me A Better Programmer"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/addressing-multiple-nosql-using-redis-modules.html", "abstract": "Developing next generation digital applications is introducing more and more different use cases of which NoSQL products need to address. Redis Labs answer to this, is to continue growing and working with the community with the introduction of Redis Modules.\nRedis Modules are add-ons to Redis which extend Redis to cover most of the popular use cases for any industry. They seamlessly plug into open source Redis or enterprise-class Redis, are processed in-memory and enjoy Redisâ\u0080\u0099 simplicity, super high performance, infinite scalability and high availability.\nIn this talk we will introduce you to Redis modules and how they can be used to execute Machine Learning models, do blazing fast text searches, storing and retrieving JSON documents.", "confName": "QCon, London 2017", "title": "Multiple NoSQL Use Cases with Redis Modules"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/distributed-pit-success.html", "abstract": "In just two years Deliveroo has expanded from central London to hundreds of cities in twelve countries, and the engineering team has grown at a similar rate. To allow us to continue innovating rapidly we need to be able to scale the team horizontally. But building distributed systems is hard, and typically requires hordes of very senior engineers with many years of experience and past failures behind them. This talk covers how Deliveroo is using domain driven design principles and powerful building blocks to remove this limitation and allow engineers of any level to quickly and successfully deploy new systems into production.", "confName": "QCon, London 2017", "title": "The Distributed Pit of Success @Deliveroo"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/julia-a-modern-language-for-modern-ml.html", "abstract": "Julia is a modern high-performance, dynamic language for technical computing, with many features which make it ideal for machine learning, including just-in-time (JIT) compilation, multiple dispatch, metaprogramming and easy to use parallelism. This talk will demonstrate these features, and showcase a some of the cutting edge machine learning packages that available in the Julia ecosystem, as well as the tools to deploy these models at large scale.", "confName": "QCon, London 2017", "title": "Julia: A Modern Language For Modern ML"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/cgroupv2-linuxs-new-unified-control-group-system.html", "abstract": "cgroupv1 (or just \"cgroups\") has helped revolutionise the way that we manage and use containers over the past 8 years. A complete overhaul is coming -- cgroupv2. This talk will go into why a new control group system was needed, the changes from cgroupv1, and practical uses that you can apply to improve the level of control you have over the processes on your servers.\nWe will go over:\n\nDesign decisions and deviations for cgroupv2 compared to v1\nPitfalls and caveats you may encounter when migrating to cgroupv2\nDiscussion of the internals of cgroupv2\nPractical information about how we are using cgroupv2 inside Facebook", "confName": "QCon, London 2017", "title": "cgroupv2: Linux's New Unified Control Group System"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/languages-presentation.html", "abstract": "Outlyer is a SaaS infrastructure monitoring tool. We process and store time-series data, which is currently at 100K points per second and growing.\nTo do the grunt work of processing and storing the growing mass of data, we originally started out with Node.JSâ\u0080\u0094quick to build and time-saving. About a year into using it, we started to reach the limits of Node, so we began to investigate a more appropriate technology. We looked closely at several options, including Java, Scala, Go, Erlang and C.\nThis talk will tell you when and why you should choose Erlang over other options, but also tell you when not to choose it.", "confName": "QCon, London 2017", "title": "Why We Chose Erlang Over vs. Java, Scala, Go, C"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/building-consensual-software.html", "abstract": "Online safety has become a huge problem in the world of oversharing. Real name policies, automatic geolocation tracking, and photo tagging increase user adoption rates, but these features can be quickly abused by bad actors. This talk will discuss how to apply a \"consent filter\" to product decisions to make a safer user experience and to help protect your most vulnerable users from harm.", "confName": "QCon, London 2017", "title": "Consensual Software: Prioritizing Trust & Safety"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/i-have-nosql-toaster.html", "abstract": "NoSQL is a catch-all term that covers a lot of different types of data storage. Is it really helpful to group them together by one thing they don't have? Think about it like this: my toaster is as much NoSQL as any database! So, how can we make more sense of this new breed of database management systems?\nIn this talk I cover the four main data models that have been part of the past ten years' NoSQL movement: key-value, document, columnar and graph. I explain how they differ and when you might want to use each one.", "confName": "QCon, London 2017", "title": "I have a NoSQL toaster"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/scaling-instagram-infrastructure.html", "abstract": "Instagram is a social network mobile app that allows people to share the world's moments as they happen. It serves 300 millions users on a daily basis throughout the world.\nIn this talk, we will give an overview on the infrastructure that supports its users on this large scale.\nTopics will include:\n\na brief history of infrastructure evolution\noverall architecture and multi-data center support\ntuning of uwsgi parameters for scaling\nperformance monitoring and diagnosis\nand django/python upgrade (why, challenges and lessons learned)", "confName": "QCon, London 2017", "title": "Scaling Instagram Infrastructure"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/policing-stock-market-machine-learning.html", "abstract": "Neurensic has built a solution, SCORE, for doing Trade Surveillance using H2O (an open-source pure Java Big Data ML tool), Machine Learning, and a whole lot of domain expertise and data munging. SCORE pulls in private and public market data and in a few minutes will search it for all sorts of bad behavior: spoofing, wash-trading and cross-trading, pinging, and a lot more. It then filters down the billions of rows of data down to human scale with some great visualizations - well enough to use as hard legal evidence. Indeed SCORE and it's underlying tech is not just used by companies to police themselves; it is being used by the public sector to find and prosecute the Bad Guys. I'll close with a demo of a Real Life bad guy - he was defrauding the markets out of 10's of millions - who got caught via an early alpha version of SCORE. All data anonymized of course, so you'll have to go hunt last years Wall Street Journal to find his name for real.", "confName": "QCon, London 2017", "title": "Policing The Stock Market with Machine Learning"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/deep-learning-scale.html", "abstract": "DSSTNE (Deep Sparse Scalable Tensor Network Engine) is a deep learning framework for working with large sparse data sets. It arose out of research into the use of deep learning for product recommendations after we realized existing frameworks were limited to a single GPU or data-parallel scaling and that they handled sparse datasets incredibly inefficiently. DSSTNE provides nearly free sparse input layers for neural networks and stores such data in a CSR-like format that allowed us to train on data sets that would otherwise have consumed Terabytes of memory and/or bandwidth. Further, DSSTNE implements a new approach to model parallel training that automatically minimizes communication costs such that for a GM204 GPU, one can attain nearly 100% efficient scaling given sufficiently large layer width (~1000 units per GM204 in use). In mid-2016 Amazon open-sourced DSSTNE in exactly the same form as it is used in production in the hopes of advancing the use of deep learning for large sparse data sets wherever the may be.", "confName": "QCon, London 2017", "title": "DSSTNE: Deep Learning at Scale"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/building-a-bank-with-go.html", "abstract": "Traditionally applications have been built as monoliths; single applications which become larger and more complex over time, which limit our ability to react to change. An example of this is the banking industry where mergers and acquisitions between banks have lead to a patchwork of different systems & technologies that cost billions of dollars per year to maintain. As a result, the pace of innovation in the banking industry has slowed to a crawl. At Monzo we're building a new kind of bank backed by a microservice platform written in Go. In this talk we'll look at why Go is perfectly suited to this style of architecture, the language features that make it particularly attractive to high volume, low latency, distributed applications, and how easy it is to adopt into existing systems and organisations.", "confName": "QCon, London 2017", "title": "Building a Bank with Go"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/building-high-performing-team.html", "abstract": "As software architects, we often focus on the technical side to building software including key platform or design decisions, or finding reasons to use the latest and great technologies. We forget that software is built by people, and without considering how people work together, architectural visions are wasted. In this talk, we will explore why and how architects should care about well-functioning teams and look at the tools and techniques architects can use to build high-performance teams.", "confName": "QCon, London 2017", "title": "Building a High Performing Team"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/multi-host-multi-network-persistent-containers-0.html", "abstract": "Containers are great vessels for your applicationâ\u0080\u0099s ephemeral data, but what about the data that drives your business? It must survive containers coming and going, maintain its availability and reliability, and grow when you need it. In this talk, we will discuss strategies for working with persistent containers, where you can store your data, and how to scale your persistent container layer. We will include code samples and interactive demos showing the power of Docker Machine, Engine, Swarm, and Compose, combined with multi-host networking, to build a reliable, scalable, and production-ready tier for the data needs of your organization.", "confName": "QCon, London 2017", "title": "Multi-host, Multi-network Persistent Containers"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/hft-laplace-demon.html", "abstract": "The race for low latency data continues. 10 years ago, Flashboys were helping HFT make money with low-latency infrastructures. Today, hedge funds build AI brains pumping hundreds of sources of data in real-time, seeking ubiquity to build Laplace Demons.", "confName": "QCon, London 2017", "title": "The Move to AI: From HFT to Laplace Demon"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/deep-learning-google-scale-smart-reply-inbox.html", "abstract": "Anjuli will describe the algorithmic, scaling and deployment considerations involved in an extremely prominent application of cutting-edge deep learning in a user-facing product: the Smart Reply feature of Google Inbox.", "confName": "QCon, London 2017", "title": "Deep Learning @Google Scale: Smart Reply in Inbox"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/embracing-containers.html", "abstract": "Containers can help you reduce the time to market significantly, specially when the whole process for creating and deploying them has been automated and reduced Â«from commit to production in 5 minutesÂ» but, is your company and its technical and cultural infrastructures ready for such a pace? Containerizing your applications allows you to improve your time to market significantly. But is your company is actually ready for such a speed? Have you thought of the cultural changes that such a technology demands? Is your process flexible and fast enough to keep pace? how is your inter-team communication and collaboration? What is the level of trust that you have in your team? These questions were asked and answered on one of our projects as we moved towards rock-solid software delivery pipeline. I will share the story with you.", "confName": "QCon, London 2017", "title": "Dev to Prod in 5 minutes: Is Your Company Ready?"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/practical-road-to-saas-in-python.html", "abstract": "This talk goes over experiences building SaaS businesses on a Python technology stack from a security and scalability point of view. Where Python shines and which technologies to pair it with for best experiences.", "confName": "QCon, London 2017", "title": "A Practical Road to SaaS' in Python"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/creating-space-to-be-awesome.html", "abstract": "Bringing agile approaches into how we manage people and lead teams can have wonderful, far-reaching impact. How do we get the most out of these new ways of working and also ensure that we create an inclusive environment where all types of people can be successful? In this session weâ\u0080\u0099ll take a closer look at the science behind great people management, to figure out how to bring these together and craft space for everyone to be awesome.", "confName": "QCon, London 2017", "title": "Creating Space To Be Awesome"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/you-cant-buy-devops-you-may-have-sell-it.html", "abstract": "Creating a DevOps culture and implementing the technical bits like Continuous Delivery often require disruptive organizational change, and almost always require executive support.\nWerenâ\u0080\u0099t all the same promises made by RUP, RAD, XP etc.? How do you sort through the vendor jargon? How can you convince jaded people who have heard this all before? How do you help people who just want to â\u0080\u009cdo their jobsâ\u0080\u009d embrace the risk of change?\nIn this talk weâ\u0080\u0099ll talk about some of the data you can use to strengthen your argument. More importantly, weâ\u0080\u0099ll talk about effective ways to make the argument, measure the success of your experiments and spread adoption.", "confName": "QCon, London 2017", "title": "You can't buy DevOps, but you may have to sell it"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/notifications-twitter.html", "abstract": "Twitter Notifications Infrastructure enables hundreds of millions of users to stay informed about whatâ\u0080\u0099s going on in their Twitter world. Our systems process large volumes of data (aka the Twitter firehose) and deliver realtime and personalized notifications to all kinds of users, ranging from Katy Perry with ~95M followers to brand new users trying out our product for the very first time. We will give an overview of unique challenges in building our notifications infrastructure, present how we solved our challenges, and share key lessons learned along the way.", "confName": "QCon, London 2017", "title": "Realtime & Personalized Notifications @Twitter"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/thinking-strategically-about-iot.html", "abstract": "Cool? Useful? Disruptor? All of the above? IoT is having an impact on more and more industries. As the cost of instrumenting things and collecting data drops, the possibilities for what we can control and the kind of insights we can gather increase. Not only is IoT hardware cheaper and more pervasive, developing IoT software is now far more accessible. That doesn't mean there aren't tricky bits. Does Java have relevance in the IoT world? How can you keep the system reliable and handle failure in a cost-effective way? How can you cope with the data volumes? What's the best way to turn raw data into insight?", "confName": "QCon, London 2017", "title": "Thinking Strategically About IoT"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/blockchain-introduction-peering-through-hype.html", "abstract": "Will answer the questions: what is a blockchain, why all the hype, what makes a blockchain secure, what can be built on top of blockchains, what are some real-world use-cases?", "confName": "QCon, London 2017", "title": "Blockchain Introduction: Peering Through the Hype"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/avoiding-alerts-overload-microservices.html", "abstract": "Microservices can be a great way to work: the services are simple, you can use the right technology for the job, and deployments become smaller and less risky. Unfortunately, other things become more complex. You probably took some time to design a deployment pipeline and set up self-service provisioning, for example. But did the rest of your thinking about what â\u0080\u009cdoneâ\u0080\u009d means catch up? Are you still setting up alerts, run books, and monitoring for each microservice as though it was a monolith?\nTwo years ago, a team at the FT started out building a microservices-based system from scratch. Their initial naive approach to monitoring meant that an underlying network issue could mean 20 people each receiving 10,000 alert emails overnight. With that volume, you canâ\u0080\u0099t pick out the important stuff. In fact, your inbox is unusable unless you have everything filtered away where youâ\u0080\u0099ll never see it. Furthermore, you have information radiators all over the place, but thereâ\u0080\u0099s always something flashing or the wrong colour. You can spend the whole day moving from one attention-grabbing screen to another.\nThat team now has over 150 microservices in production. So how they get themselves out of that mess and regain control of their inboxes and their time? First, you have to work out whatâ\u0080\u0099s important, and then you have to ruthlessly narrow down on that. You need to be able to see only the things you need to take action on in a way that tells you exactly what you need to do. Sarah shares how her team regained control and offers some tips and tricks.", "confName": "QCon, London 2017", "title": "Avoiding Alerts Overload From Microservices"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/sql-server-linux-will-it-perform-or-not.html", "abstract": "Will SQL Server perform on Linux better than on Windows? Have you been wondering whether the multi-layer architecture the team revealed recently will hurt SQL Serverâ\u0080\u0099s performance? Are you still not convinced about the entire endeavor. Come, listen to the talk, learn about SQL Serverâ\u0080\u0099s platform agnostic architecture then derive the answers for yourself. The talk will briefly go over history of the project, high level architecture and dive fast into core of I/O Manager, Memory Manager, and Scheduler. To make the talk more fun, every topic will include lessons learned and experiences behind the scenes.", "confName": "QCon, London 2017", "title": "SQL Server On Linux: Will It Perform Or Not?"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/tasty-topics-distributed-systems.html", "abstract": "Are you struggling to pick through large amounts of real time data? Does your IoT project create vast amounts of data and you donâ\u0080\u0099t know how get actionable insights quickly enough? Did you consider the publish/subscribe pattern?\nWith some imagination, pub/sub can often provide surprisingly simple, efficient solutions. In this talk Iâ\u0080\u0099ll highlight some interesting ways to apply pub/sub to some common problems:\n\nMigrating between data formats;\nFinding the nearestâ\u0080¦ thing;\nReplaying of the state of the world;\nControlling third party access to data;\nMonitoring the health of your pub/sub technology.", "confName": "QCon, London 2017", "title": "Tasty 'Topics' for Distributed Systems"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/distributed-systems-theory-practical-engineers.html", "abstract": "Distributed Systems are a complex topic. There's abundant research about it but sometimes it is hard for a beginner to know where to start. I would like to outline the main concepts of distributed systems, so the interested person can have a clear path on how to start their own research as well. In this talk I will review the different models: asynchronous vs. synchronous distributed systems; message passing vs shared memory communication; failure detectors and leader election problems; consensus and different kinds of replication.\nI will also review a series of books on distributed systems in order to recommend the best one according to the topics we would like to learn about, or the problems we would like to solve. The goal of the talk is to set a good foundation for people interested in learning more about distributed systems.\nTalk objectives: When learning about Distributed Systems there are lot of books and papers to chose from, with many of them having titles that are hard to understand. It's difficult then to judge their relevance to our interests if we don't know the topic already. The goal of the talk is to lay a common ground for Distributed Systems so everyone can benefit from the current research on the topic.\nTarget audience: Engineers interested in getting started with Distributed Systems.", "confName": "QCon, London 2017", "title": "Distributed Systems Theory for Practical Engineers"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/concurrent-parallel.html", "abstract": "As core counts continue to increase, how we exploit hardware parallelism in practice shifts from concurrency â\u0080\u0094 using more cores to handle more user requests â\u0080\u0094 to parallelism â\u0080\u0094 using more cores to solve data-intensive problems faster. This talk will explore the different goals, tools, and techniques involved between these various approaches, and how to analyze a computation for potential parallelism, with specific attention to the parallel stream library in Java.", "confName": "QCon, London 2017", "title": "From Concurrent to Parallel"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/do-you-really-know-your-response-times.html", "abstract": "With the recent surge in highly available microsevervices with high incoming traffic, it is becoming more and more important to know how your service is performing right now and to be able to diagnose issues in production quickly. It took a while for us to understand how to produce meaningful graphs and alerts that help us truly understand our application performance.\nWe initially found that most developers did not understand what they were measuring and that many of the graphs caused confusion. In this talk I show how we collect application performance metrics at Sky.\nI focus on the use of histogram metrics to monitor response times, explain how reservoir sampling can help and show the trade-offs among reservoir types. Finally I illustrate, with real-world examples, some good and bad practices when monitoring response times.", "confName": "QCon, London 2017", "title": "Do You Really Know Your Response Times?"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/assuring-crypto-code-with-automated-reasoning.html", "abstract": "Bugs in software are ubiquitous, but the impact of these bugs can vary widely. Sometimes they are largely benign, and at other times they can have catastrophic effects. Bugs in cryptographic software tend to be especially serious. To add to that, cryptographic algorithms are difficult to design and implement, requiring intricate and rare expertise. And even worse, such software operates in a context that can be assumed to be malicious, rather than random.\nTo achieve confidence of the correctness of cryptographic implementations in this context, we therefore need to apply a more rigorous testing standard. Ideally, we want to be able to test an implementation on all possible inputs. Fortunately, advances in automated reasoning technology, particularly in SAT and SMT solvers, makes exactly this approach possible, and even efficient.\nThis talk will describe the capabilities and operation of some open source tools that allow developers to conclusively and largely automatically determine whether a low-level cryptographic implementation, written in a language such as C, exactly matches a higher-level mathematical specification. We will particularly focus on work we have done to integrate these tools into the continuous integration system of Amazon's s2n implementation of TLS.", "confName": "QCon, London 2017", "title": "Assuring Crypto Code with Automated Reasoning"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/how-backdoor-invulnerable-code.html", "abstract": "It is easy to think that securing a product relies on writing code without vulnerabilities and it's true that this is a very important aspect, but a secure product relies on more than just the code written. To an attacker every aspect involved in the development process, from the human element to the build pipeline, is fair game. In this talk we'll take a candid look at the real tactics, with examples, used to compromise and backdoor seemingly secure products by exploiting the humans and systems that create them.", "confName": "QCon, London 2017", "title": "How to Backdoor Invulnerable Code"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/session-about-bot-framework-microsoft.html", "abstract": "The Microsoft Bot Framework in combination with the Cognitive Services platform enables developers to quickly build Bots that are not captive to any one conversation canvas. Whilst itâ\u0080\u0099s easy to get going with the technology, building a great experience that delights customers is more challenging. In this session weâ\u0080\u0099ll cover some best practices that weâ\u0080\u0099ve learnt in our initial engagements and show how you can transform your Bot experience live in the session.", "confName": "QCon, London 2017", "title": "Microsoft Bot Framework Best Practices"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/spotifys-reliable-event-delivery-system.html", "abstract": "Spotifyâ\u0080\u0099s event delivery system is one of the foundational pieces of Spotifyâ\u0080\u0099s data infrastructure. It has a key requirement to reliably deliver complete data with a predictable latency and make it available to Spotify developers via well-defined interface. Delivered data is than used to produce Discover Weekly, Fresh Finds, Spotify Party and many other Spotify features. Currently 1M events is delivered via Spotify's event delivery system every second. To seamlessly scale the system we designed it as a set of micro-services. System is using Google Cloud Pub/Sub for transferring vast amounts of data between Spotify's data-centres. This talk is going to cover the design and operational aspects of Spotifyâ\u0080\u0099s reliable event delivery system.", "confName": "QCon, London 2017", "title": "Spotify's Reliable Event Delivery System"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/real-world-java-9.html", "abstract": "The feature we always hear about whenever Java 9 is in the news is Jigsaw (or modularity). But this doesn't scratch the same developer itch that Java 8's lambdas and streams did, and we're left with a vague sensation that the next version might not be that interesting.\nJava 9 actually has a lot of great additions and changes to make development a bit nicer. These features can't be lumped under an umbrella term like Java 8's lambdas and streams, the changes are scattered throughout the APIs and language features that we regularly use.\nIn this presentation, Trisha shows via live coding:\n\nHow we can use the new Flow API to utilise Reactive Programming\nHow the improvements to the Streams API make it easier to control real-time streaming data\nHow to the Collections convenience methods simplify code\n\nAlong the way, we'll bump into other Java 9 features, including some of the additions to interfaces and changes to deprecation. Weâ\u0080\u0099ll see that once you start using Java 9, you can't go back to before.", "confName": "QCon, London 2017", "title": "Real World         Java 9"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/practical-blockchains-building-bitcoin.html", "abstract": "Talk will answer the questions:\n\nWhy use Bitcoin over other blockchains\nWhat are safe, future proof ways to peg data to Bitcoin's blockchain\nWhat is Bitcoin script, and how can it be used?", "confName": "QCon, London 2017", "title": "Practical Blockchains: Building on Bitcoin"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/pony-co-designing-type-system-and-run-time.html", "abstract": "Pony is an actor-model, capabilities-secure, native programming language. I will talk about reference capabilities (a type system for data-race freedom influenced by object capabilities and deny guarantee reasoning), the ORCA and MAC protocols for fully concurrent no-stop-the-world garbage collection of both objects and actors, and extending Pony to the distributed setting.", "confName": "QCon, London 2017", "title": "Pony: Co-Designing A Type-System And A Run-Time"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/building-secure-player-experiences-riot-games.html", "abstract": "In this talk, David will give you an overview of the Riot Games Application Security program. The talk will focus on the tech and social aspects of the program and why David feels both are important when it comes to writing secure code. Specifically David will talk about how we define Application Security at Riot, how weâ\u0080\u0099ve grown to meet the demands of our fast paced engineering organisation, why weâ\u0080\u0099ve hired software engineers into our team and the tools weâ\u0080\u0099ve developed to help Rioters globally build fun and safe experiences for our players. David will also explain why heâ\u0080\u0099s been working with a behavioural scientist from our Insights team to help level up security at Riot. Software will never be free security vulnerabilities so this talk will also explain why Riot runs a bug bounty program and how thatâ\u0080\u0099s changed our Application Security program.", "confName": "QCon, London 2017", "title": "Building Secure Player Experiences At Riot Games"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/implementing-your-own-chatbot-platform.html", "abstract": "Chatbot is a computer program which conducts a conversation via auditory or textual interaction.\nThis talk provides an overview of technologies used for chatbots. We will take an in-depth look at building blocks such as information access through natural language processing, Data driven approach, Single/Multi turn dialogues, Sentence representation & intent detection, use of deep learning methods.\nFinally, we will distill core-concepts from these to describe a general purpose scalable chatbot platform.", "confName": "QCon, London 2017", "title": "Implementing Your Own Chatbot Platform!"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/java-presentation-0.html", "abstract": "Have you ever wondered about event sourced systems and how they work? How to structure things around a transaction log yet still keep the system stable over time when change arises. In this talk we will look at Event Sourcing as a concept as well as specific JVM based implementations that are available. A main focus will also be on where such an implementation would be beneficial (or not!).", "confName": "QCon, London 2017", "title": "Event Sourcing on the JVM"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/case-study-alternate-blockchains.html", "abstract": "It seems that everyone is creating their own blockchain. Is this justified, or should they be using Bitcoin? This talk will use Namecoin and Monero as case studies to see what advantages exist for using a different blockchain, what approaches exist for doing so (e.g. merge-mined sidechains), and what risks you might be exposing your users to if you use a blockchain that isn't as secure as Bitcoin.", "confName": "QCon, London 2017", "title": "Case Study: Alternate Blockchains"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/monitoring-serverless-architectures.html", "abstract": "Serverless architectures are attracting more and more interest from the IT professionals and companies hoping to lower the costs of creating and operating distributed systems without constant worrying about availability, scalability and capacity management. Despite all the attractive properties that serverless architectures offer, such systems still need to be comprehensively monitored to be effectively operated and maintain the expected quality of service and SLAs.\nIn this talk, I will provide the overview of monitoring capabilities required by system built on the Serverless stack, discuss various AWS services that can be used to deliver such capabilities. I will cover everything from metering and logging to tracing, auditing and alerting.\nAdditionally, I will share some top tips on how to monitor and optimise the spend on the cloud infrastructure as well as control and adjust provisioned capacity for the resources that use provisioned capacity model, like DynamoDB and Kinesis.\nLastly, I will also offer some suggestions on how to supplement providerâ\u0080\u0099s own solutions with bespoke extensions, built using the Serverless stack, to provide even more comprehensive monitoring.", "confName": "QCon, London 2017", "title": "Monitoring Serverless Architectures"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/modern-cs-panel.html", "abstract": "Types, testability, tooling, paradigms, productivity, managed, native, concurrency, parallelism, performance, asynchrony, integrations, memory management, security, resilience, or, maybe, simple readability? What are the important things crossing the minds of language designers today as they build new languages or evolve the tried and trusted ones?\nQCon convenes a panel of four language designers. These are people at the heart of questions like these. The computer science language panel is led by Martin Thompson and participants include:\n\nBrian Goetz (Java)\nJoe Duffy (Midori, C# Fork)\nFelix Klock (Rust)\nSylvan Clebsch (Pony)\n\nCome hear Martin ask the hard questions on choices made (past and future) and hear the discussion from the people behind some of the largest and most innovative languages in use by developers today.", "confName": "QCon, London 2017", "title": "Panel: What's Next for Our Programming Languages?"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/making-most-out-bad-day-developer.html", "abstract": "You know how it goes. There is always someone that finds out how to break all the hard work you and your team have put in developing a kick-ass application. Nobody likes to receive security bug reports but they are a reality we have to deal with. Penetration testers, bug bounty programs, independent researchers, and security incidents all provide us with invaluable information to develop better code. The question then becomes what we do with what we learned and how we prevent similar vulnerabilities to appear again. This presentation is a tale of war stories from my experience as a penetration tester and the numerous years of work with development teams building secure development practices. I hope to help you in understanding the value of security bugs for you, your organisations and your clients.", "confName": "QCon, London 2017", "title": "Making the Most out of a Bad Day as a Developer"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/devops-microservices-stress-free-incidents.html", "abstract": "Many organisationsâ\u0080\u0094especially engineering-led onesâ\u0080\u0094are embracing microservices and DevOps as a mechanism for handing autonomy to developers across the life-cycle, from language, framework, and platform technology choices in the development phase to monitoring and management technologies when things move to production.\nWhile this is a great recipe for developer motivation, it can lead to problems in running the production estate over the longer term as a lack of consistency hampers on-boarding and the effectiveness of first-responder teams, who are responsible for the overall availability and incident management that development teams move on.\nPete Holditch explores how various organisations have combined microservice-based development with DevOps and outlines the various pitfalls and trade-offs this entails.\nTopics include:\n\nAn analysis of the tension between DevOps and incident management\nReal-world examples of how various enterprises have employed application performance management (APM) technology to balance competing needs\nHow APM provides a feedback loop across the application life-cycle", "confName": "QCon, London 2017", "title": "DevOps, microservices, and stress-free incidents"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/straggler-free-data-processing-cloud-dataflow.html", "abstract": "One of the main causes of performance problems in distributed data processing systems (from the original MapReduce to modern Spark and Flink) is \"stragglers.\" Stragglers are parts of the input that take an unexpectedly long time to process, delaying the completion of the whole job, and wasting resources that stay idle. Stragglers can happen due to imbalance of data distribution or processing complexity, hardware/networking anomalies, and a variety of other factors.\nGoogle Cloud Dataflow is the first system to address the problem of stragglers in a fully general way. By dynamically redistributing parts of already launched work from straggler workers onto idle workers to maximize utilization, Google Cloud Dataflow is able to preserve data consistency and minimizing re-execution.\nThis talk describes the theory and practice behind Cloud Dataflow's approach to straggler elimination, as well as the associated non-obvious challenges, benefits, and implications of the technique.", "confName": "QCon, London 2017", "title": "Straggler Free Data Processing in Cloud Dataflow"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/fire-walk-using-flamegraphs-illuminate-jvm.html", "abstract": "FlameGraphs offer us a new way to visualize execution profiles, combined with Linux system profiler perf and the recently added -XX:+PreserveFramePointer option in JDK 8u60 we now have for the first time a way to capture a comprehensive profile for the OS, JVM and your Java code.\nIn this session, we explore the JVM and Java applications using this new perspective and reflect on the profiles and the utility of this new method:\n\nIntroduction to FlameGraphs\nOld School? FlameGraphs using jstack and honest-profiler\nperf-map-agent + FlameGraphs + Java\nJava code left+right+center (oh yes, you are so special my child!)\nProfiling the profilers\nCompilers ate my mother profile\nGC thrashed my dad profile\nAnd more advanced FlameGraphs usage as time permits!", "confName": "QCon, London 2017", "title": "Using FlameGraphs To Illuminate The JVM"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/big-ideas-decentralised-storage.html", "abstract": "Will cover: the need for distributed / decentralised storage, real life use-cases for distributed storage systems, dealing with data loss in a distributed system, brief overview of IPFS and Sia, building on top of distributed storage systems", "confName": "QCon, London 2017", "title": "Big Ideas: Decentralised Storage"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/after-acceptance-reasoning-about-system-outputs.html", "abstract": "Modern software development allows us to prove that new work is functionally complete. We write a set of executable specifications. We automatically execute them in the form of acceptance tests as part of our continuous delivery pipeline. When all the tests pass, we are done!\nThis approach is superior to what came before it but is by no means perfect. Testing frequently ends at the point of release, meaning that bugs in production can be caught late and by the end users. Pragmatism dictates that exhaustive acceptance testing is infeasible. Indeed, tests are likely to represent only a simplified version of user interactions. In production, data will almost certainly be generated by code paths that have not been fully exercised in acceptance tests. That data is usually decoupled from our acceptance testing environment. If the current version of the system generates durable data, how do we know that future versions will consider it valid and act upon it appropriately? How can we find out about bugs after acceptance, but before our customers do?\nThis session will walk through some techniques for bringing your testing to production. It will show you how to sanity check a live system using end to end testing, limiting interference with real user interactions and outputs. Finally it suggests ways to observe and integrate real production data into a continuous delivery pipeline and assert on the validity of the production system's outputs.", "confName": "QCon, London 2017", "title": "After Acceptance: Reasoning About System Outputs"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/introduction-to-property-based-testing.html", "abstract": "Testing is a cornerstone of modern software development. It provides us with a safety net against bugs and regressions â\u0080\u0093 without testing, it would be impossible to write large-scale applications.\nThe traditional approach to testing relies on hard-coded examples: fire some specific inputs into a function, and compare the result to predetermined, expected output. This means somebody has to think of examples to test, but humans are notoriously bad at coming up with random data. So why not let the computer do it for us?\nIn this talk, you'll learn about property-based testing. You tell the computer what sort of test data to use, and let it fill in the blanks. This allows the computer to try many, many more examples than you could write by hand. It's a great way to find bugs in your software â\u0080\u0093 before they reach your users.\nWeâ\u0080\u0099ll see this style of testing through the lens of two libraries: Hypothesis and AFL, with examples and testing patterns that you can apply in your own code.", "confName": "QCon, London 2017", "title": "Property-Based Testing In Practice"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/out-browser-fire.html", "abstract": "Authors: Shubs Shah, Matt Bryant, and Joe DeMesy", "confName": "QCon, London 2017", "title": "Out of the Browser Into the Fire"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/agile-devops-better-way-0.html", "abstract": "Together we are on a share quest; to make our customers happier, our organizations more successful, the world a more connected place. Our tool of choice is software. Our goal to delivery more compelling software, faster! Our go to answer is Agile and evolving to DevOps. But what does this really mean for the existing enterprise and how do we get there? In this session, we will explore these questions and potential answers through the examination of a past development project gone awry.", "confName": "QCon, London 2017", "title": "Agile to DevOps. A Better Way?"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/causal-consistency-for-large-neo4j-clusters.html", "abstract": "In this talk we'll explore the new Causal clustering architecture for Neo4j. We'll see how Neo4j uses the Raft protocol for a robust underlay for intensive write operations, and how the asynchronous new scale-out mechanism provides enormous capacity for very demanding graph workloads.\nWe'll discuss the cluster architecture's new causal consistency model. Causal consistency is a big leap forward compared to the commonplace eventual consistency which makes it convenient to write applications that use the full capacity of the cluster. In particular we'll show how despite the mixture of concensus protocols and asynchronous replication, that Neo4j allows users to read their own writes straightforwardly and discuss why this is such a difficult achievement in distributed systems.\nFor the application developer, we'll show how Neo4j's Causal Clustering optimised drivers makes it easyto write applications that scale smoothly from a single server to a large, distributed cluster: a practical motivation for the distributed systems enthusiast.", "confName": "QCon, London 2017", "title": "Causal Consistency For Large Neo4j Clusters"}, {}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/the-oracle-problem.html", "abstract": "Will cover: why the oracle problem is so hard (specifically, this historical evolution of failures, from API, to clearnet website, to darknet website, to multisig escrow, to judicial \"competition\", to Ethereum/Augur, and why they fail), may also cover basics of blockchain (\"blockchain as immortal software\", ledger \"rents\", revenge of \"the idea guy\").", "confName": "QCon, London 2017", "title": "Blockchain: The Oracle  Problems"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/observability-event-sourcing-and-state-machines.html", "abstract": "What is a way to have complete transparency of the state of a service? Ideally we would record everything - the inputs, outputs and timings - in order to capture highly reproducible and transparent state changes. However, is it possible to record every event or message in and out of a service without hurting performance? Join Peter for an exploration of the use cases and practicalities for having downstream services consuming all of the state changes of an upstream service in order to provide automated, real-time insight of services.", "confName": "QCon, London 2017", "title": "Observability, Event Sourcing and State Machines"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/power-of-the-log-lsm-pppend-only-data-structures.html", "abstract": "This talk is about the beauty of sequential access and append only data structures. We'll do this in the context of a little known paper entitled â\u0080\u009cLog Structured Merge Treesâ\u0080\u009d. LSM describes a surprisingly counterintuitive approach to storing and accessing data in a sequential fashion. It came to prominence in Google's Big Table paper and today, the use of Logs, LSM and append only data structures drive many of the world's most influential storage systems: Cassandra, HBase, RocksDB, Kafka and more. Finally we'll look at how the beauty of sequential access goes beyond database internals, right through to how applications communicate, share data and scale.", "confName": "QCon, London 2017", "title": "Power of the Log:LSM & Append Only Data Structures"}, {"url": "https://qconlondon.com/london-2017/london-2017/presentation/will-cut-you-gos-sharper-edges.html", "abstract": "An expression of function within a software ecosystem is inextricably bound to the lexicon used to express it. I explore how distinct, exploitable misuse patterns arise in software languages, and through example in Go â\u0080\u0093 in particular a quietly prevalent and worryingly effective denial of service attack on Go systems affecting the Go toolchain itself â\u0080\u0093 hope to begin greater discourse on the language's distinct security characteristics.", "confName": "QCon, London 2017", "title": "This Will Cut You: Go's Sharper Edges"}]